module.exports = `<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1485px">
    <tbody>
        <tr align="center">
            <td><b>Таблиця 6. Відомості про нарахування заробітної плати (доходу, грошового забезпечення) застрахованим особам</b></td>
        </tr>
    </tbody>
</table>
<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1485px">
    <tbody>
        <tr>
            <td width="30%">1.  Код за ЄДРПОУ або реєстраційний номер облікової картки платника податків/серія (за наявності) та/або  номер паспорта страхувальника*</td>
            <td width="10%">{{#textInput}}DECLAR.DECLARBODY.HTIN####{"style": "font-weight: bold;"}{{{}}}{{/textInput}}</td>
            <td width="50%">2. Код за ЄДРПОУ або реєстраційний номер облікової картки платника податків/серія (за наявності)  та/або номер паспорта ліквідованого страхувальника* (заповнюється у разі подачі звіту правонаступником)</td>
            <td width="10%">{{#textInput}}DECLAR.DECLARBODY.HTIN1####{"style": "font-weight: bold;"}{{{}}}{{/textInput}}</td>
        </tr>
    </tbody>
</table>
<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1485px">
    <tbody>
        <tr>
            <td class="td_box">{{#textInput}}DECLAR.DECLARBODY.HNAME####{"style": "font-weight: bold;"}{{{}}}{{/textInput}}</td>
        </tr>
        <tr>
            <td align="center">(найменування страхувальника) </td>
        </tr>
    </tbody>
</table>
<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1485px">
    <tbody>
        <tr>
            <td width="20%">3. Звіт за місяць</td>
            <td class="td_box" width="5%">{{#intInput}}DECLAR.DECLARBODY.HZM{{{}}}{{/intInput}}</td>
            <td align="right" width="10%">pік</td>
            <td class="td_box" width="5%">{{#intInput}}DECLAR.DECLARBODY.HZY{{{}}}{{/intInput}}</td>
            <td align="right" width="10%">4. Тип</td>
            <td align="right" width="10%">початкова    </td>
            <td class="td_box" width="5%">{{#booleanInput}}DECLAR.DECLARBODY.HZB{{{}}}{{/booleanInput}}</td>
            <td align="right" width="10%">скасовуюча    </td>
            <td class="td_box" width="5%">{{#booleanInput}}DECLAR.DECLARBODY.HZS{{{}}}{{/booleanInput}}</td>
        </tr>
    </tbody>
</table>
<br>
<table id="table" style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse; border: 1px solid black;" border="1" cellspacing="0" cellpadding="0px" bordercolor="black" width="1485px">
  <thead>
    <tr>
      <td align="center" rowspan="2" width="2%" class="no-print">&nbsp;</td>
      <td align="center" rowspan="2" width="2%"> №  з/п  </td>
      <td align="center" rowspan="2" width="4%"> 6. Грома-<br>дянин Украї-<br>ни <br>(1 - так, <br>0 - ні)</td>
      <td align="center" width="2%"> 7. Чо-<br>ло-<br>вік - Ч, жін-<br>ка - Ж</td>
      <td align="center" width="10%"> 8. Реєстраційний номер облікової картки платника податків або серія (за наявності) та/або  номер паспорта за формою БКNNХХХХХХ/ПХХХХХХХХХ ЗО *</td>
      <td align="center" width="4%"> 9. Код катего-<br>рії ЗО** </td>
      <td align="center" width="4%"> 10. Код типу нараху-<br>вань *** </td>
      <td align="center" colspan="2" width="9%"> 11. Місяць та рік, за який проведено нарахування**** </td>
      <td align="center" width="6%"> 13. Кількість календарних днів  тимча-<br>сової непра-<br>цездатності </td>
      <td align="center" width="7%"> 15. Кількість  календарних днів перебування у трудових / цивільно-<br>правових відносинах, проходження військової служби протягом  звітного місяця</td>
      <td align="center" width="14%"> 17. Загальна сума нарахованої заробітної плати / доходу,  грошового збезпечення (усього з початку звітного місяця)<br>(грн. коп.) </td>
      <td align="center" rowspan="2" width="13%"> 19. Сума різниці між розміром мінімальної заробітної плати та фактично нарахованою заробітною платою за звітний місяць (із заробітної плати / доходу/грошового забезпечення/) доплата до мінімального страхового внеску  <br>(грн. коп.)</td>
      <td align="center" width="13%"> 20. Сума утриманого єдиного внеску за звітний місяць (із заробітної плати / доходу/грошового забезпечення  <br>(грн. коп.)</td>
      <td align="center" width="5%"> 22. Ознака наявності трудової книжки     <br>      (1-так,  0-ні) </td>
      <td align="center" width="5%"> 24. Ознака неповного робочого часу        <br>     (1-так,  0-ні) </td>
    </tr>
    <tr>
      <td align="center" colspan="6"> 12. Прізвище Iм'я По батькові ЗО  </td>
      <td align="center"> 14. Кількість календарних  днів без збереження заробітної плати *****  </td>
      <td align="center"> 16. Кількість календаних днів відпустки у зв'язку з вагітністю та пологами </td>
      <td align="center"> 18. Сума нарахованої заробітної плати / доходу  /грошового забезпечення у  межах максимальної величини, на яку нараховується єдиний внесок <br>(грн. коп.) </td>
      <td align="center"> 21. Сума нарахованого єдиного внеску за звітний місяць (на заробітну плату / дохід/грошове забезпечення )<br>(грн. коп.)</td>
      <td align="center"> 23. Ознака наявності спецстажу             <br>      (1-так, 0-ні)  </td>
      <td align="center"> 25. Ознака нового робочого місця            <br>     (1-так,  0-ні) </td>
    </tr>
  </thead>
  <tbody id="Process">
    {{#generatorRows}}T1{{{}}}{{/generatorRows}}
  </tbody>
</table>
<br>
<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1485px">
  <tbody>
  <tr>
    <td>*  Для фізичних осіб, які мають відмітку в паспорті про право здійснювати будь-які платежі за серією та/або 
    номером паспорта зазначаються, серія(за наявності)  та номер БКNNXXXXXX, де БК - константа, що вказує на реєстрацію 
    за паспортними даними; NN - дві українські літери серії паспорта (верхній регістр); XXXXXX - шість цифр номера паспорта 
    (з ведучими нулями) або ПХХХХХХХХХ, де П - константа, що вказує на реєстрацію за паспортними даними; 
    ХХХХХХХХХ – дев’ять цифр номера паспорта , що у формі пластикової картки.</td>
  </tr>
  <tr>
    <td>** Код категорії ЗО - обирається з таблиці відповідності кодів категорії застрахованої особи та кодів бази 
    нарахування і розмірів ставок єдиного внеску на загальнообов'язкове державне соціальне страхування (додаток 2).</td>
  </tr>
  <tr>
    <td>
      *** Код типу нарахувань:	<br>																																																							
      1 – сума заробітної плати (доходу) за виконану роботу (надані послуги), строк виконання яких (якої) перевищує календарний
      місяць, а також за відпрацьований час після звільнення з роботи або згідно з рішенням суду - середня заробітна плата 
      за вимушений прогул, сума грошового забезпечення - нарахована у попередніх звітних періодах;	<br>																																																							
      2 - сума заробітної плати (доходу) грошового забезпечення, нарахована у попередніх звітних періодах на підставі 
      бухгалтерських та інших документів, відповідно до яких проводиться нарахування (обчислення) або які підтверджують 
      нарахування (обчислення) заробітної плати (доходу), на яку страхувальником самостійно донараховано суму єдиного внеску;<br>																																																						
      3 - сума заробітної плати (доходу) грошового забезпечення, нарахована у попередніх звітних періодах на підставі 
      бухгалтерських та інших документів, відповідно до яких проводиться нарахування (обчислення)   або   які  підтверджують 
      нарахування (обчислення) заробітної плати (доходу), на яку  страхувальником самостійно зменшено зайво нараховану
      суму єдиного внеску;<br>																																																					
      6 – сума заробітної плати (доходу), нарахована у попередніх звітних періодах на підставі бухгалтерських та інших 
      документів, відповідно до яких проводиться нарахування (обчислення) або які підтверджують нарахування (обчислення) 
      заробітної плати (доходу), на яку страхувальником самостійно донараховано суму внесків на загальнообов'язкове 
      державне пенсійне страхування за період до 01 січня 2011 року;<br>																																																		
      7 - сума заробітної плати (доходу), нарахована у попередніх звітних періодах на підставі бухгалтерських та інших документів, 
      відповідно до яких проводиться нарахування (обчислення)   або   які  підтверджують  нарахування (обчислення) 
      заробітної плати (доходу), на яку  страхувальником самостійно зменшено нараховану суму внесків на загальнообов'язкове 
      державне пенсійне страхування за період до 01 січня 2011 року;<br>																																																
      8 - сума заробітної плати (доходу), нарахована у попередніх звітних періодах на підставі бухгалтерських та інших документів,
      відповідно до яких проводиться нарахування (обчислення) або які підтверджують нарахування (обчислення) заробітно
      ї плати (доходу), на яку при перевірці органом Пенсійного фонду України донараховано суму внесків на загальнообов'язкове
      державне пенсійне страхування за період до 01 січня 2011 року;<br>																																																							
      9 - сума заробітної плати (доходу), нарахована у попередніх звітних періодах на підставі бухгалтерських та інших документів,
      відповідно до яких проводиться нарахування (обчислення)   або   які  підтверджують  нарахування (обчислення)
      заробітної плати (доходу), на яку  при перевірці органом Пенсійного фонду України зменшено нараховану суму внесків
      на загальнообов'язкове державне пенсійне страхування за період до 01 січня 2011 року;<br>																																																						
      10 – нарахована сума заробітку (доходу) грошового забезпечення за дні відпустки;<br>																																																						
      11 - сума заробітної плати (доходу) грошового забезпечення, нарахована у попередніх звітних періодах на підставі 
      бухгалтерських та інших документів, відповідно до яких проводиться нарахування (обчислення) або які підтверджують 
      нарахування (обчислення) заробітної плати (доходу), на яку при перевірці органами доходів і зборів донараховано 
      суму єдиного внеску;<br>																																																						
      12 - сума заробітної плати (доходу) грошового забезпечення, нарахована у попередніх звітних періодах на підставі 
      бухгалтерських та інших документів, відповідно до яких проводиться нарахування (обчислення) або які підтверджують
      нарахування (обчислення) заробітної плати (доходу), на яку при перевірці органами доходів і зборів зменшено зайво
      нараховану суму єдиного внеску;<br>																																																						
      13 - сума різниці між розміром мінімальної заробітної плати та фактично нарахованою заробітною платою за 
      звітний місяць (із заробітної плати / доходу, грошового забезпечення);<br>	
      14 -	сума різниці між розміром мінімальної заробітної плати та фактично нарахованої заробітної плати (доходом) 
      за попередні періоди, у зв'язку із здійсненням перерахунку при звільненні працівника за попередні періоди, що пов'язані 
      з уточненням днів використаної наперед відпустки (у зв'язку із сторнуванням).																																																		
    </td>
  </tr>
  <tr>
    <td>****   Місяць та рік, за який проведено нарахування, - реквізит обов’язково повинен бути заповнений.    </td>
  </tr>
  <tr>
    <td> ***** Кількість календарних  днів без збереження заробітної плати - кількість календарних днів може 
    бути відображено зі знаком мінус у разі необхідності зменшення кількості таких днів, відображених у попередніх 
    звітних періодах.</td>
  </tr>
  </tbody>
</table>
<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1050px">
   <tbody>
      <tr>
         <td width="85%">26. Дата формування у страхувальника:</td>
         <td align="center" class="td_box" width="10%">{{#dateInput}}DECLAR.DECLARBODY.HFILL{{{}}}{{/dateInput}}</td>
      </tr>
   </tbody>
</table>
<table style="table-layout: fixed; margin-left: 15px; font-family: TimesNewRoman; border-collapse: collapse;" cellspacing="0" cellpadding="0px" width="1050px">
  <tbody>
    <tr>
      <td width="15%">27. Керівник</td>
      <td width="5%">&nbsp;</td>
      <td class="td_box" width="30%">{{#textInput}}DECLAR.DECLARBODY.HKBOS{{{}}}{{/textInput}}</td>
      <td width="5%">&nbsp;</td>
      <td class="td_unln" width="10%">&nbsp;</td>
      <td width="5%">&nbsp;</td>
      <td class="td_box" width="30%">{{#textInput}}DECLAR.DECLARBODY.HBOS{{{}}}{{/textInput}}</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>&nbsp;</td>
      <td>(податковий  номер /серія (за наявності) та/або номер паспорта*)</td>
      <td>&nbsp;</td>
      <td align="center">
        <font size="-1">(підпис)</font>
      </td>
      <td>&nbsp;</td>
      <td align="center">
        <font size="-1">(ініціали та прізвище)</font>
      </td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>&nbsp;</td>
      <td>&nbsp;</td>
      <td>&nbsp;</td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td>28. Головний бухгалтер</td>
      <td>&nbsp;</td>
      <td class="td_box">{{#textInput}}DECLAR.DECLARBODY.HKBUH{{{}}}{{/textInput}}</td>
      <td>&nbsp;</td>
      <td class="td_unln">&nbsp;</td>
      <td>&nbsp;</td>
      <td class="td_box">{{#textInput}}DECLAR.DECLARBODY.HBUH{{{}}}{{/textInput}}</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td>&nbsp;</td>
      <td>(податковий  номер /серія (за наявності) та/або номер паспорта*)</td>
      <td>&nbsp;</td>
      <td align="center">
        <font size="-1">(підпис)</font>
      </td>
      <td>&nbsp;</td>
      <td align="center">
        <font size="-1">(ініціали та прізвище)  </font>
      </td>
    </tr>
  </tbody>
</table>`
