module.exports.run = (conn, migrationParams) => {
  const codes = {
    'РбДн': '000000',
    'РбНп': '000000',
    'Вчр': '000000',
    'Ніч': '000000',
    'Ндрч': '000000',
    'Свт': 'FF0000',
    'Вдр': '0000FF',
    'Восн': '0000FF',
    'Вдод': '0000FF',
    'Вчорн': '0000FF',
    'Втвор': '0000FF',
    'Внавч': '0000FF',
    'Внавчбз': '0000FF',
    'Вобов': '0000FF',
    'Допл': '0000FF',
    'Вваг': '0000FF',
    'В3дит': '0000FF',
    'Вдит': '0000FF',
    'Взст': '0000FF',
    'Вінбз': '0000FF',
    'Внеповн': '0000FF',
    'Вперевед': '0000FF',
    'НевідІн': '0000FF',
    'Моб': '0000FF',
    'Прст': '0000FF',
    'Пргл': '0000FF',
    'Вих': 'FF0000',
    'ЛікХвор': '0000FF',
    'ЛікДогл': '0000FF',
    'ЛікНеопл': '0000FF',
    'НеявкаПрч': '0000FF',
    'НеявкаДог': '0000FF',
    'НеявкаІн': '0000FF',
    'НВдр': '0000FF',
    'РВСвт': '000000',
    'ПідвКв': '0000FF',
    'ДГОбов': '0000FF',
    'ДоПідг': '0000FF',
    'ВЗб': '0000FF',
    'ВДон': '0000FF',
    'Вдг': '0000FF',
    'ВдсР': '0000FF',
    'НеПідЛ': '0000FF',
    'ВдрС': '0000FF',
    'ВдрР': '000000',
    'Ні': '000000',
    'НіПр': '000000',
    'Війс': '000000'
  }

  const dictPositions = conn.Repository('hr_dictTimeCost')
    .attrs(['ID', 'code'])
    .selectAsObject()

  dictPositions.forEach(item => {
    if (codes[item.code]) {
      conn.update({
        entity: 'hr_dictTimeCost',
        __skipOptimisticLock: true,
        execParams: {
          ID: item.ID,
          colorText: codes[item.code]
        }
      })
    }
  })
}
