module.exports = [
  {
    entity: 'hr_dictTimePrint',
    localeAttr: ['name', 'nameAdd'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictTimePrint').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['code'],
    attrs: ['code', 'name', 'nameAdd', 'orderN'],
    items: [
      [ '1', 'відрядження', 'ВД (код 07)', 1 ],
      [ '2', 'основні щорічні відпустки', 'В (код 08)', 2 ],
      [ '3', 'щорічна додаткова відпустка', 'Д (код 09)', 3 ],
      [ '4', 'додаткова відпустка у зв\'язку з навчанням', 'Н (код 12)', 4 ],
      [ '5', 'додаткова оплачувана відпустка працівникам, які мають дітей', 'ДО (код 15)', 5 ],
      [ '6', 'відпустка у зв\'язку з вагітністю та пологами або по догляду за дитиною до 3-х років', 'ВП (код 16)', 6 ],
      [ '7', 'відпустка по догляду за дитиною до 6-ти років', 'ДД (код 17)', 7 ],
      [ '8', 'відпустка без збереження заробітної плати за згодою сторін', 'НА (код 18)', 8 ],
      [ '9', 'день відпочинку за роботу у вихідний день', 'ІН (код 22)', 9 ],
      [ '10', 'курси підвищення кваліфікації', 'ІН (код 22)', 10 ],
      [ '11', 'оплата по середньому заробітку мобілізованим працівникам, контракт', 'ІН (код 22)', 11 ],
      [ '12', 'оплачувана тимчасова непрацездатність', 'ТН (код 26)', 12 ],
      [ '13', 'неоплачувана тимчасова непрацездатність', 'НН (код 27)', 13 ],
      [ '14', 'інші', 'інші', 14 ],
      [ '15', null, null, 15 ]
    ]
  }
]
