module.exports = [
  {
    entity: 'hr_dictSicknessCause',
    localeAttr: ['name', 'fullName'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictSicknessCause').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['code'],
    attrs: ['code', 'name', 'fullName', 'isOther', 'dateFromEmpty', 'dateToEmpty'],
    items: [
      ['1', 'Постраждалий ЧАЄС', 'звітність подано не за всі календарні місяці розрахункового періоду', false, null, null],
      ['2', 'Помилки у звітності', 'самостійно виявлено помилки в звітності, які буде усунуто', false, null, null],
      ['3', 'Нарахування без ЕСВ', 'в розрахунковому періоді, наявні періоди отримання виплат за окремими видами соціального страхування без сплати страхових внесків', false, null, null],
      ['4', 'За фактично відпрацьований час', 'нові трудові відносини, розрахунок проведено за фактично відпрацьований час (календарні дні) перед настанням страхового випадку', false, null, null],
      ['5', 'За плановим заробітком', 'у розрахунковому періоді перед настанням страхового випадку застрахована особа з поважних причин не мала заробітку або страховий випадок настав у перший день роботи, розрахунок допомоги проведено з тарифної ставки (посадового окладу)', false, null, null],
      ['6', 'Коментар (Інше)', 'інше – Коментар страхувальника', true, null, null]
    ]
  }
]
