module.exports = [
  {
    entity: 'hr_dictSickLimit',
    localeAttr: ['name', 'fullName'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictSickLimit').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['code'],
    attrs: ['code', 'name', 'fullName', 'typeSickLimit', 'dateFromEmpty', 'dateToEmpty'],
    items: [
      ['1', 'Постраждалий ЧАЄС', 'ЗО, віднесеним до 1-3 категорій осіб, які постраждали внаслідок аварії на ЧАЕС', '3', null, null],
      ['2', 'Дитина-постраждала ЧАЕС', 'одному з батьків або особі, що їх замінює та доглядає хвору дитину віком до 14 років, яка постраждала внаслідок аварії на ЧАЕС', '2', null, null],
      ['3', 'Учасник бойових дій', 'ветеранам війни, постраждалим учасникам Революції Гідності та членам сімей загиблих (померлих) ветеранів війни, членам сімей загиблих (померлих) Захисників і Захисниць України', '5', null, null],
      ['4', 'Жертви нацистських переслідувань', 'особам, віднесеним до жертв нацистських переслідувань відповідно до Закону України "Про жертви нацистських переслідувань"', null, null, null],
      ['5', 'Донор', 'донорам, які мають право на пільгу, передбачену статтею 20 Закону України "Про безпеку та якість донорської крові та компонентів крові"', '6', null, null],
      ['6', 'Реабілітовані', 'особам, реабілітованим відповідно до Закону України "Про реабілітацію жертв репресій комуністичного тоталітарного режиму 1917-1991 років", із числа тих, яких було піддано репресіям у формі (формах) позбавлення волі (ув’язнення) або обмеження волі чи примусового безпідставного поміщення здорової людини до психіатричного закладу за рішенням позасудового або іншого репресивного органу', null, null, null],
      ['7', 'Дія Сіті', 'ЗО, яка є працівником або гіг-спеціалістом резидента Дія Сіті', null, null, null],
      ['8', 'Медичний працівник', 'медичний працівник (для причини непрацездатності 10 Перебування в самоізоляції, обсервації під час дії карантину, встановленого Кабінетом Міністрів України з метою запобігання поширенню гострої респіраторної хвороби COVID-19, спричиненої коронавірусом SARS-СoV-2)', null, null, null],
      ['9', 'Дитина-інвалід', 'Дитина-інвалід', '1', null, null],
      ['10', 'Ліквідатор ЧАЕС', 'Ліквідатор ЧАЕС', '4', null, null]

    ]
  }
]
