module.exports = [
  {
    entity: 'hr_dictMilitaryDuty',
    localeAttr: ['name', 'orderTitle', 'orderText'],
    notDelete: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'orderTitle', 'orderText'],
    items: [
      ['1', 'Строкова', 'на строкову військову службу', 'строкової військової служби'],
      ['2', 'Контракт', 'за контрактом', 'служби за контрактом'],
      ['3', 'Призов осіб офіцерського складу', 'на військову службу за призовом осіб офіцерського складу', 'військової служби за призовом осіб офіцерського складу']
    ]
  }
]
