module.exports = [
  {
    entity: 'hr_dictReasonDism',
    localeAttr: ['name', 'lawName'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'lawName', 'dismPayValue', 'isDueToDeath'],
    items: [
      ['01', 'За власним бажанням', 'ст. 38 КЗпП', null, 0],
      ['02', 'За власним бажанням у зв’язку з виходом на пенсію', 'ст. 38 КЗпП', null, 0],
      ['03', 'Закінчення строку трудового договору', 'п.2 ст. 36 КЗпП', null, 0],
      ['04', 'За угодою сторін', 'п.1 ст. 36 КЗпП', null, 0],
      ['05', 'У зв’язку із скороченням штату', 'п.1 ст.40 КЗпП', 1, 0],
      ['06', 'У зв’язку з переведенням', 'п.5 ст. 36 КЗпП', null, 0],
      ['07', 'Зміна істотних умов трудового договору', 'п.6 ст. 36 КЗпП', 1, 0],
      ['08', 'Зміни в організації виробництва і праці', 'п.1 ст.40 КЗпП', 1, 0],
      ['09', 'Невідповідність працівника займаній посаді', 'п.2 ст.40 КЗпП', 1, 0],
      ['10', 'Систематичне невиконання працівником без поважних причин обов’язків', 'п.3 ст.40 КЗпП', null, 0],
      ['11', 'Прогул', 'п.4 ст.40 КЗпП', null, 0],
      ['12', 'Нез’явлення на роботу протягом більш як чотирьох місяців підряд внаслідок тимчасової непрацездатності', 'п.5 ст.40 КЗпП', null, 0],
      ['13', 'Поновлення на роботі працівника, який раніше виконував цю роботу', 'п.6 ст.40 КЗпП', 1, 0],
      ['14', 'Появи на роботі в нетверезому стані, у стані наркотичного або токсичного сп’яніння', 'п.7 ст.40 КЗпП', null, 0],
      ['15', 'Вчинення за місцем роботи розкрадання майна', 'п.8 ст.40 КЗпП', null, 0],
      ['16', 'Виконнаня обов’язків голови виборчої комісії', null, null, 0],
      ['17', 'Відповідно до Указу Президента України', null, null, 0],
      ['18', 'За результатами випробування', 'п.11 ст.40 КЗпП', null, 0],
      ['19', 'За станом здоров’я, що перешкоджає продовженню данної роботи', ' ст. 38 КЗпП', null, 0],
      ['20', 'Зміна місця проживання', 'ст. 38 КЗпП', null, 0],
      ['21', 'У зв’язку із виконанням держобов`язків', null, null, 0],
      ['22', 'У зв’язку зі смертю', 'Інша', null, 1],
      ['23', 'Відмова працівника від переведення на роботу в іншу місцевість разом із підприємством, установою, організацією', 'п.6 ст. 36 КЗпП', 1, 0],
      ['24', 'Відмова в наданні допуску до державної таємниці або скасування допуску до державної таємниці, якщо виконання покладених на працівника обов’язків вимагає доступу до державної таємниці', null, 1, 0],
      ['25', 'Порушення власником або уповноваженим ним органом законодавства про працю, колективного або трудового договору', 'п.5 ст.41 КЗпП', 3, 0],
      ['26', 'Припинення повноважень посадових осіб', 'п.5 ст.41 КЗпП', 6, 0]
    ]
  }
]
