module.exports = [
  {
    entity: 'hr_dictTrainingForm',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'groupCategory'],
    items: [
      ['01', 'Професійна програма підвищення кваліфікації', '1'],
      ['02', 'Тематичні постійно діючі семінари', '1'],
      ['03', 'Спеціалізовані короткострокові навчальні курси', '1'],
      ['04', 'Тематичні короткострокові семінари;', '1'],
      ['05', 'Тренінг (як тематичний короткостроковий захід)', '1'],
      ['06', 'Стажування', '1'],
      ['07', 'Самостійне навчання (самоосвіта)', '1'],
      ['08', 'Професійна програма підвищення кваліфікації', '2'],
      ['09', 'Тематичні постійно діючі семінари', '2'],
      ['10', 'Спеціалізовані короткострокові навчальні курси', '2'],
      ['11', 'Тематичні короткострокові семінари;', '2'],
      ['12', 'Тренінг (як тематичний короткостроковий захід)', '2'],
      ['13', 'Стажування', '2'],
      ['14', 'Самостійне навчання (самоосвіта)', '2']
    ]
  }
]
