module.exports = [ {
  entity: 'hr_dictProfCompDevelopForm',
  localeAttr: ['name'],
  notDelete: true,
  notUpdate: true,
  identifier: 'code',
  attrs: ['code', 'name'],
  items: [
    [1, 'професійна програма підвищення кваліфікації'],
    [2, 'тематичний постійно діючий семінар'],
    [3, 'спеціалізований короткостроковий навчальний курс'],
    [4, 'тематичний короткостроковий семінар'],
    [5, 'тренінг (тематичний короткостроковий захід)'],
    [6, 'стажування'],
    [7, 'самостійне навчання (самоосвіта)']
  ]
}
]
