module.exports = [
  {
    entity: 'hr_dictTimeCost',
    identifier: ['code'],
    localeAttr: ['name', 'nameSmall', 'nameShort'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictTimeCost').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    attrsConfig: {
      dictTimePrintID: function (value, params, conn) {
        if (value) {
          const dictTimePrint = conn.Repository('hr_dictTimePrint').attrs(['ID'])
            .where('code', 'in', value.split(','))
            .selectAsObject()
          return dictTimePrint.length ? dictTimePrint.map(o => o.ID).join(',') : null
        } else {
          return null
        }
      },
      orderClassID: { associatedEntity: 'hr_orderClass', codeAttr: 'numCode' }
    },
    attrs: ['code', 'dictTimePrintID', 'name', 'nameSmall', 'nameShort', 'timeCostType', 'timeColumns', 'colorText', 'isShowWork', 'orderClassID'],
    items: [
      ['РбДн', null, 'Години роботи, передбачені Правилами внутрішнього трудового розпорядку', 'Робочий', 'Р', 'WORK', '0', '000000', 1],
      ['РбНп', null, 'Години роботи працівників, яким встановлено неповний робочий день (тиждень) згідно з законодавством', 'Неповний робочий', 'РС', 'WORK', '0', '000000', 1, 1000],
      ['Вчр', null, 'Вечірні години', 'Вечірні години', null, 'OTHER', '0', '000000', 0, 1000],
      ['Ніч', null, 'Нічні години', 'Нічні години', null, 'OTHER', '0', '000000', 0, 1000],
      ['Ндрч', null, 'Надурочні години', 'Надурочні години', null, 'OTHER', '0', '000000', 0, 1000],
      ['Свт', null, 'Свято', 'Свято', 'Свт', 'FREE', '0', 'FF0000', 0, 1000],
      ['Вдр', '1', 'Відрядження', 'Відрядження', 'ВД', 'ABSENCE', '3', '0000FF', 0, 1000],
      ['Восн', '2', 'Основна щорічна відпустка (ст.6 Закону України “Про відпустки”)', 'Відпустка щорічна', 'В', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Вдод', '3', 'Щорічна додаткова відпустка (ст. 7, 8 Закону України “Про відпустки”)', 'Відпустка додаткова', 'Д', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Вчорн', '3', 'Додаткова відпустка, передбачена ст. 20, 21, 30 Закону України “Про статус і соціальний захист громадян, які постраждали внаслідок Чорнобильської катастрофи”', 'Відпустка чорнобильська', 'Ч', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Втвор', '14', 'Творча відпустка (ст.16 Закону України “Про відпустки”)', 'Відпустка творча', 'ВТ', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Внавч', '4', 'Додаткова відпустка у зв’язку з навчанням (ст.13, 14, 15, 15, 15.1, 16 Закону України “Про відпустки”)', 'Відпустка навчальна оплачувана', 'Н', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Внавчбз', '4', 'Відпустка без збереження заробітної плати у зв’язку з навчанням (пп. 12, 13, 17 ст. 25 Закону України “Про відпустки”)', 'Відпустка навчальна не оплачувана', 'НБ', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Вобов', '4', 'Додаткова відпустка без збереження заробітної плати в обов’язковому порядку (ст. 25, крім пп. 3, 12, 13, 17 Закону України "Про відпустки")', 'Відпустка не оплачувана за законом', 'ДБ', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Допл', '5', 'Додаткова оплачувана відпустка працівникам, які мають дітей (ст. 19 Закону України “Про відпустки”)', 'Відпустка додаткова на дітей', 'ДО', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Вваг', '12', 'Оплачувана тимчасова непрацездатність, тимчасова непрацездатність (відпустка) у зв’язку з вагітністю та пологами (ст. 17 Закону України "Про відпустки")', 'Відпустка у зв\'язку з вагітністю та пологами', 'ТН', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['В3дит', '6', 'Відпустка для догляду за дитиною до досягнення нею трирічного віку (ст. 18 Закону України "Про відпустки")', 'Відпустка по догляду до 3 років', 'ВП', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Вдит', '7', 'Відпустка для догляду за дитиною до досягнення нею 6-ти річного віку (ст. 25 п.3 Закону України “Про відпустки”)', 'Відпустка по догляду до 6 років', 'ДД', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Взст', '8', 'Відпустка без збереження заробітної плати за згодою сторін (ст. 26 Закону України "Про відпустки")', 'Відпустка не оплачувана за згодою сторін', 'НА', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Вінбз', '14', 'Інші відпустки без збереження заробітної плати (на період припинення виконання робіт)', 'Відпустка не оплачувана (інше)', 'БЗ', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Внеповн', '14', 'Неявки у зв’язку з переведенням за ініціативою роботодавця на неповний робочий день (тиждень)', 'Переведення роботодавцем на неповний робочий день', 'НД', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['Вперевед', '14', 'Неявки у зв’язку з тимчасовим переведенням на роботу на інше підприємство на підставі договорів між суб’єктами господарювання', 'Неявки при переведенні на інше підприємство', 'НП', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['НевідІн', '14', 'Інший невідпрацьований час, передбачений законодавством', 'Неявки, передбачені законодавством', 'ІН', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['Моб', '11', 'Відпустка по мобілізації', 'Відпустка по мобілізації', 'МБ', 'ABSENCE', '2', '0000FF', 0, 1000],
      ['Прст', '14', 'Простої, тимчасове призупинення', 'Простої, тимчасове призупинення', 'П', 'WORK', '0', '0000FF', 1, 1000],
      ['Пргл', '14', 'Прогули, запізнення', 'Прогули, запізнення', 'ПР', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['Вих', null, 'Вихідний', 'Вихідний', 'Вих', 'FREE', '0', 'FF0000', 0, 1000],
      ['ЛікХвор', '12', 'Лікарняний \\ Оплачувана тимчасова непрацездатність по хворобі', 'Лікарняний по хворобі', 'Л', 'ABSENCE', '1', '0000FF', 0, 3006],
      ['ЛікДогл', '12', 'Лікарняний \\ Оплачувана тимчасова непрацездатність по догляду', 'Лікарняний по догляду', 'Л', 'ABSENCE', '1', '0000FF', 0, 3006],
      ['ЛікВаг', '6', `Тимчасова непрацездатність  у зв’язку з вагітністю та пологами (ст. 17 Закону України "Про відпустки")`, 'Лікарняний у зв\'язку з вагітністю та пологами', 'ВП', 'ABSENCE', '1', '0000FF', 0, 3006],
      ['ЛікНеопл', '13', 'Неоплачувана тимчасова непрацездатність у випадках, передбачених законодавством (у зв’язку з побутовою травмою та ін., підтверджена довідками лікувальних закладів)', 'Лікарняний неоплачуваний', 'Л', 'ABSENCE', '1', '0000FF', 0, 1000],
      ['НеявкаПрч', '14', 'Неявки з нез’ясованих причин', 'Неявки з нез’ясованих причин', 'НЗ', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['НеявкаДог', '14', 'Інші види неявок, передбачених колективними договорами, угодами', 'Неявки за колективним договором', 'ІН', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['НеявкаІн', '14', 'Інші причини неявок', 'Неявки з іншіх причин', 'І', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['НВдр', '14', 'Відрядження, для якого наказ ще не затверджено', 'Непідтверджене відрядження', 'ВД', 'ABSENCE', '3', '0000FF', 0, 1000],
      ['РВСвт', null, 'Години роботи у вихідні та святкові дні', 'Робота у вихідні та свята', 'РВ', 'WORK', '0', '000000', 1, 1000],
      ['ПідвКв', '10', 'Підвищення кваліфікації', 'Підвищення кваліфікації', 'ПК', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['ДГОбов', '14', 'Виконання державних і громадських обов’язків', 'Виконання державних і громадських обов’язків', 'ДО', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['ДоПідг', '14', 'Допризовна підготовка', 'Допризовна підготовка', 'ДО', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['ВЗб', '11', 'Військові збори', 'Військові збори', 'ВЗ', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['ВДон', '14', 'Донорські', 'Донорські', 'ДВ', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['Вдг', '9', 'Відгул', 'Відгул', 'ВГ', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['ВдсР', '14', 'Відсторонення від роботи (без збереження заробітної плати), передбачені законодавством', 'Відсторонення від роботи', 'ВР', 'ABSENCE', '0', '0000FF', 0, 1000],
      ['НеПідЛ', '14', 'Непідтверджений лікарняний', 'Непідтверджений лікарняний', 'НЛ', 'ABSENCE', '1', '0000FF', 0, 1000],
      ['ВдрС', '1', 'Відрядження розраховане за середньоденним заробітком', 'Відрядження (за середнім)', 'ВДС', 'ABSENCE', '3', '0000FF', 0, 1000],
      ['ВдрР', '1', 'Відрядження розраховане як робочий час', 'Відрядження (робочий час)', 'ВДР', 'WORK', '3', '000000', 1, 1000],
      ['Ні', null, 'Не працював', 'Не працював', '-', 'NOT', '0', '000000', 0, 1000],
      ['НіПр', null, 'Не має призначення', 'Не має призначення', '-', 'NOT', '0', '000000', 0, 1000],
      ['Війс', null, 'Військова служба за призовом під час мобілізації на особливий період згідно з Законом від 27.03.2014 р. № 1169-\\/ІІ', 'Військова служба', 'ВМ', 'ABSENCE', '0', '000000', 0, 1000],
      ['Кор', null, 'Коригування робочих днів за імпортованими даними', 'Коригування (імп)', '*', 'ABSENCE', '0', 'FF0000', 0, 1000]
    ]
  }
]
