module.exports = [
  {
    entity: 'hr_dictEducationLevel',
    localeAttr: ['name', 'nominalName'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictEducationLevel').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['code'],
    attrs: ['code', 'name', 'nominalName', 'level', 'educationKind', 'isActive'],
    items: [
      ['01', 'Дошкільна освіта', 'Дошкільна освіта', 0, null, 1],
      ['02', 'Початкова освіта', 'Початкова освіта', 1, null, 1],
      ['03', 'Базова середня освіта', 'Базова середня освіта', 2, '1', 1],
      ['04', 'Профільна середня освіта', 'Профільна середня освіта', 3, '1', 1],
      ['05', 'Перший (початковий) рівень професійної (професійно-технічної) освіти', 'Перший (початковий) рівень професійної (професійно-технічної) освіти', 2, '1', 1],
      ['06', 'Другий (базовий) рівень професійної (професійно-технічної) освіти', 'Другий (базовий) рівень професійної (професійно-технічної) освіти', 3, '1', 1],
      ['07', 'Третій (вищий) рівень професійної (професійно-технічної) освіти', 'Третій (вищий) рівень професійної (професійно-технічної) освіти', 4, '1', 1],
      ['08', 'Фахова передвища освіта', 'Фахова передвища освіта', 5, '1', 1],
      ['09', 'Початковий рівень (короткий цикл) вищої освіти', 'Вища освіта (молодший бакалавр)', 6, '1', 1],
      ['10', 'Перший (бакалаврський) рівень вищої освіти', 'Вища освіта (бакалавр)', 7, '1', 1],
      ['11', 'Другий (магістерський) рівень вищої освіти', 'Вища освіта (магістр)', 8, '1', 1],
      ['12', 'Третій (освітньо-науковий/освітньо-творчий) рівень вищої освіти - аспірантура', 'Аспірантура', 9, '1', 1],
      ['13', 'Третій (освітньо-науковий/освітньо-творчий) рівень вищої освіти - ад`юнктура', 'Ад`юнктура', 9, '1', 1],
      ['14', 'Третій (освітньо-науковий/освітньо-творчий) рівень вищої освіти - докторантура', 'Докторантура', 9, '1', 1],
      ['15', 'Науковий рівень вищої освіти', 'Доктор наук', 10, '1', 1],
      ['16', 'Післядипломна професійна підготовка', 'Післядипломна освіта', null, '2', 1],
      ['17', 'Професійна освіта на виробництві', 'Професійне навчання на виробництві', null, '3', 1],
      ['18', 'Неповна загальна середня', 'Неповна загальна середня (старий термін)', 2, '1', 1],
      ['19', 'Повна загальна середня', 'Повна загальна середня (старий термін)', 3, '1', 1],
      ['20', 'Середня', 'Середня (старий термін)', 3, '1', 1],
      ['21', 'Середня технічна', 'Середня технічна (старий термін)', 4, '1', 1],
      ['22', 'Середня спеціальна', 'Середня спеціальна (старий термін)', 4, '1', 1],
      ['23', 'Професійно-технічна‚ кваліфікований робітник', 'Професійно-технічна‚ кваліфікований робітник', 4, '1', 1],
      ['24', 'Незакінчена вища', 'Незакінчена вища (старий термін)', null, null, 1],
      ['25', 'Неповна вища‚ молодший спеціаліст', 'Неповна вища‚ молодший спеціаліст (старий термін)', 6, '1', 1],
      ['26', 'Базова вища‚ молодший спеціаліст', 'Базова вища‚ молодший спеціаліст (старий термін)', 6, '1', 1],
      ['27', 'Повна вища‚ спеціаліст', 'Повна вища‚ спеціаліст (старий термін)', 8, '1', 1],
      ['28', 'Повна вища‚ магістр', 'Повна вища‚ магістр (старий термін)', 8, '1', 1],
      ['29', 'Вища', 'Вища (старий термін)', 8, '1', 1],
      ['30', 'Навчається', 'Навчається', null, null, 1],
      ['999', '(інші види)', '(інші види)', null, null, 1]
    ]
  }
]
