module.exports = [
  {
    entity: 'hr_dictStReport',
    identifier: 'code',
    localeAttr: ['name'],
    notDelete: true,
    attrs: ['code', 'name'],
    items: [
      ['01', '1-ПВ (щомісячний)'],
      ['02', '1-ПВ (щоквартальний)'],
      ['03', 'Довідка про кількість штатних одиниць та ФЗП за категоріями персоналу'],
      ['04', 'КСДС'],
      ['05', 'Типовий штатний розпис'],
      ['06', 'Штатний розпис з доплатами та надбавками'],
      ['07', 'Тарифікація'],
      ['08', 'Штатний розпис з доплатами та надбавками (по видам нарахувань)'],
      ['09', 'Зведений штатний розпис з доплатами та надбавками'],
      ['10', 'Зведений штатний розпис з відображенням Військових звань'],
      ['11', 'Кількісний склад організіції'],
      ['12', 'Штатний розпис з нарахуваннями'],
      ['f1k', 'Форма 1-к. Кількість, склад та переміщення працівників'],
      ['f17l', 'Форма 17. Лікарі'],
      ['f17n', 'Форма 17. Середній медичний персонал'],
      ['f20s', 'Форма 20. Штати закладу на кінець звітного року'],
      ['f20nm', 'Форма 20. Кількість фізичних осіб спеціалістів з вищою немедичною освітою - основних працівників'],
      ['f31e', 'Форма 31-Енерго'],
      ['rAvgSal', 'Звіт по середній заробітній платі']
    ]
  }
]
