module.exports = [
  {
    entity: 'hr_dictReasonMoving',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'notStoreInWorkBook', 'isOldSalary'],
    items: [
      ['01', 'Переведення на іншу роботу на тому ж підприємстві', 0, 0],
      ['02', 'Переведення на роботу в іншу місцевість', 0, 0],
      ['03', 'Тимчасове переведення у зв’язку з форс мажорними обставинами', 1, 0],
      ['04', 'Тимчасове переведення працівників на іншу роботу в разі простою', 1, 0],
      ['05', 'Постійне переведення працівників на легшу роботу за станом здоров’я', 0, 1],
      ['06', 'Тимчасове переведення працівників на легшу роботу за станом здоров’я', 1, 0],
      ['07', 'Переведення на легшу роботу вагітних жінок і жінок, які мають дітей віком до трьох років', 1, 0],
      ['08', 'Переведення на нижчу посаду', 0, 1],
      ['09', 'Переміщення на інше робоче місце', 1, 1]
    ]
  }
]
