module.exports = [
  {
    entity: 'hr_dictTarifCoeff',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'koef'],
    items: [
      [ '1', 'Тарифний розряд 1', 1],
      [ '2', 'Тарифний розряд 2', 1.09 ],
      [ '3', 'Тарифний розряд 3', 1.18 ],
      [ '4', 'Тарифний розряд 4', 1.27 ],
      [ '5', 'Тарифний розряд 5', 1.36 ],
      [ '6', 'Тарифний розряд 6', 1.45 ],
      [ '7', 'Тарифний розряд 7', 1.54 ],
      [ '8', 'Тарифний розряд 8', 1.64 ],
      [ '9', 'Тарифний розряд 9', 1.73 ],
      [ '10', 'Тарифний розряд 10', 1.82 ],
      [ '11', 'Тарифний розряд 11', 1.97 ],
      [ '12', 'Тарифний розряд 12', 2.12 ],
      [ '13', 'Тарифний розряд 13', 2.27 ],
      [ '14', 'Тарифний розряд 14', 2.42 ],
      [ '15', 'Тарифний розряд 15', 2.58 ],
      [ '16', 'Тарифний розряд 16', 2.79 ],
      [ '17', 'Тарифний розряд 17', 3 ],
      [ '18', 'Тарифний розряд 18', 3.21 ],
      [ '19', 'Тарифний розряд 19', 3.42 ],
      [ '20', 'Тарифний розряд 20', 3.64 ],
      [ '21', 'Тарифний розряд 21', 3.85 ],
      [ '22', 'Тарифний розряд 22', 4.06 ],
      [ '23', 'Тарифний розряд 23', 4.27 ],
      [ '24', 'Тарифний розряд 24', 4.36 ],
      [ '25', 'Тарифний розряд 25', 4.51 ]
    ]
  }
]
