module.exports = [
  {
    entity: 'hr_dictCases',
    localeAttr: ['name', 'nameNom', 'nameGen', 'nameDat', 'nameAcc', 'nameOr', 'nameLoc', 'nameVoc'],
    notDelete: true,
    notUpdate: true,
    identifier: 'name',
    attrs: ['name', 'nameNom', 'nameGen', 'nameDat', 'nameAcc', 'nameOr', 'nameLoc', 'nameVoc'],
    items: [
      ['сектор', 'сектор', 'сектора', 'сектору', 'сектор', 'сектором', 'секторі', 'секторе'],
      ['Генеральний департамент', 'Генеральний департамент', 'Генерального департаменту', 'Генеральному департаменту', 'Генеральний департамент', 'Генеральним департаментом', 'Генеральному департаменті', 'Генеральний департаменте'],
      ['відділ', 'відділ', 'відділу', 'відділу', 'відділу', 'відділом', 'відділі', 'відділе'],
      ['департамент', 'департамент', 'департаменту', 'департаменту', 'департамент', 'департаментом', 'департаменті', 'департаменте'],
      ['департамент управління', 'департамент управління', 'департаменту управління', 'департаменту управління', 'департамент управління', 'департаментом управління', 'департаменті управління', 'департаменте управління'],
      ['Апарат', 'Апарат', 'Апарата', 'Апарату', 'Апарат', 'Апаратом', 'Апараті', 'Апарате'],
      ['Керівництво', 'Керівництво', 'Керівництва', 'Керівництву', 'Керівництво', 'Керівництвом', 'Керівництві', 'Керівництво'],
      ['Адміністративно-господарське управління', 'Адміністративно-господарське управління', 'Адміністративно-господарське управління', 'Адміністративно-господарському управлінню', 'Адміністративно-господарське управління', 'Адміністративно-господарським управлінням', 'Адміністративно-господарському управлінні', 'Адміністративно-господарське управління'],
      ['Директорат', 'Директорат', 'Директората', 'Директорату', 'Директорат', 'Директоратом', 'Директораті', 'Директорате'],
      ['експертна група', 'експертна група', 'експертної групи', 'експертній групі', 'експертна група', 'експертною групою', 'експертній групі', 'експертна група'],
      ['загальний відділ', 'загальний відділ', 'загального відділу', 'загальному відділу', 'загальний відділ', 'загальним відділом', 'загальному відділі', 'загальний відділе'],
      ['Мобілізаційний відділ', 'Мобілізаційний відділ', 'Мобілізаційного відділу', 'Мобілізаційному відділу', 'Мобілізаційний відділ', 'Мобілізаційним відділом', 'Мобілізаційному відділі', 'Мобілізаційний відділе'],
      ['Патронатна служба', 'Патронатна служба', 'Патронатної служби', 'Патронатній службі', 'Патронатна служба', 'Патронатною службою', 'Патронатній службі', 'Патронатна служба'],
      ['протокольний відділ', 'протокольний відділ', 'протокольного відділу', 'протокольному відділу', 'протокольний відділ', 'протокольним відділом', 'протокольному відділі', 'протокольний відділ'],
      ['Управління', 'Управління', 'Управління', 'Управлінню', 'Управління', 'Управлінням', 'Управлінні', 'Управління'],
      ['Урядовий уповноважений', 'Урядовий уповноважений', 'Урядового уповноваженого', 'Урядовому уповноваженому', 'Урядового уповноваженого', 'Урядовим уповноваженим', 'Урядовому уповноваженому', 'Урядовий уповноважений'],
      ['Юридичний департамент', 'Юридичний департамент', 'Юридичного департаменту', 'Юридичному департаменту', 'Юридичний департамент', 'Юридичним департаментом', 'Юридичному департаменті', 'Юридичний департаменте'],
      ['служба', 'служба', 'служби', 'службі', 'службу', 'службою', 'службі', 'службо']
    ]
  }
]
