module.exports = [
  {
    entity: 'hr_dictContractKind',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['contractType', 'code', 'name', 'isTerm'],
    items: [
      ['1', '01', 'безстроковий', 0],
      ['1', '02', 'на визначений строк', 1],
      ['1', '03', 'на час виконання роботи', 1],
      ['1', '04', 'тимчасовий (до 2 місяців)', 1],
      ['1', '05', 'тимчасовий (до 4 місяців)', 1],
      ['1', '06', 'сезонний (до 6 місяців)', 1],
      ['1', '07', 'контракт', 1],
      ['2', '08', 'договір про надання послуг', 1],
      ['2', '09', 'підряд', 1],
      ['2', '10', 'доручення', 0],
      ['2', '11', 'авторський договір', 0],
      ['1', '20', 'тимчасовий (із поверненням)', 1]
    ]
  }
]
