module.exports = [
  {
    entity: 'hr_dictHarmfulKind',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name'],
    items: [
      ['10030', 'мікроклімат (температура, вологість, швидкість руху повітря, інфрачервоне випромінювання)'],
      ['10040', 'барометричний тиск'],
      ['10050', 'неіонізуючі електромагнітні поля та випромінювання'],
      ['10060', 'іонізуючі випромінювання'],
      ['10070', 'виробничий шум, ультразвук, інфразвук'],
      ['10080', 'вібрація (локальна, загальна)'],
      ['10090', 'освітлення'],
      ['10100', 'іонізація повітря'],
      ['10110', 'хімічні фактори'],
      ['10120', 'біологічні фактори'],
      ['10130', 'важкість праці'],
      ['10140', 'напруженість праці'],
      ['11090', 'шкідливі (список 1)'],
      ['11100', 'шкідливі (список 2)']
    ]
  }
]
