module.exports = [
  {
    entity: 'hr_dictTask',
    localeAttr: ['name', 'task'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'task', 'empOrderType', 'isCommon', 'isActive'],
    items: [
      ['01', 'Проводити відповідні розрахунки та виплати', 'Відділу бухгалтерського обліку та звітності Управління фінансів та бухгалтерського обліку проводити відповідні розрахунки та виплати згідно з чинним законодавством України.', 'COMMON', 1, 1],
      ['02', 'Провести відповідні розрахунки та виплати', 'Відділу бухгалтерського обліку та звітності Управління фінансів та бухгалтерського обліку провести відповідні розрахунки та виплати згідно з чинним законодавством України.', 'COMMON', 1, 1],
      ['03', 'Проводити відповідні розрахунки та виплати', 'Відділу бухгалтерського обліку та звітності Департаменту фінансів та бухгалтерського обліку проводити відповідні розрахунки та виплати згідно з чинним законодавством України.', 'COMMON', 1, 1],
      ['04', 'Провести відповідні розрахунки та виплати', 'Відділу бухгалтерського обліку та звітності Департаменту фінансів та бухгалтерського обліку провести відповідні розрахунки та виплати згідно з чинним законодавством України.', 'COMMON', 1, 1],
      ['05', 'Врахувати зазначені зміни при розрахунках та виплатах', 'Відділу бухгалтерського обліку та звітності Департаменту фінансів та бухгалтерського обліку врахувати зазначені зміни при розрахунках та виплатах згідно з чинним законодавством України.', 'COMMON', 1, 1],
      ['06', 'Провести відповідні розрахунки та виплати', 'Міжрегіональному управлінню  Національного агентства України з питань державної служби у Вінницькій, Житомирській та Хмельницькій областях, провести відповідні розрахунки та виплати згідно з вимогами чинного законодавства України.', 'COMMON', 1, 1],
      ['07', 'Перевірка та оприлюднення інформації про конкурс', 'Відділу управління персоналом забезпечити організацію перевірки та оприлюднення інформації про проведення конкурсу в установленому законодавством порядку.', 'COMMON', 1, 1],
      ['08', 'Компенсація за роботу у вихідний день', 'Компенсацію за роботу у вихідний день здійснити відповідно до чинного законодавства України.', 'COMMON', 1, 1],
      ['09', 'Виплатити грошову допомогу', 'Виплатити ______________ грошову допомогу у розмірі середньомісячної заробітної плати.', 'COMMON', 1, 1],
      ['10', 'Виплатити матеріальну допомогу на оздоровлення', 'Виплатити ______________ матеріальну допомогу на оздоровлення у розмірі середньомісячного заробітку.', 'COMMON', 1, 1],
      ['11', 'Контроль за виконанням залишаю за собою', 'Контроль за виконанням цього наказу залишаю за собою.', 'COMMON', 1, 1]
    ]
  }
]
