module.exports = [
  {
    entity: 'hr_dictPenaltyReason',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'idxNum'],
    items: [
      [ '01', 'Відсутність контролю за дотриманням фінансової дисципліни‚ допущення переплати при виконанні ремонтно-будівельних робіт', 10 ],
      [ '02', 'Відсутність контролю за раціональним використанням коштів Державного фонду сприйяння зайнятості населення та невжиття заходів по усуненню недоліків‚ виявлених ревізією КР', 20 ],
      [ '03', 'Підписання недостовірної накладної на отримання комп’ютерів‚ що призвело до втрати 1280‚ 00 грн. фонду зайнятості', 30 ],
      [ '04', 'Неналежне виконання службових обов’язків (ст. 14)', 40 ],
      [ '05', 'Безводповідальне ставлення до контролю за цільовим використанням коштів фонду сприяння зайнятості ч. 1 ст. 167', 50 ],
      [ '06', 'Порушення трудової дисципліни (ст. 147 КЗпПУ)', 60 ],
      [ '07', 'Невиконання підпункту 1. 5 пункту 1 наказу ДЦЗ від 11. 02. 99 №9‚ порушення фінансової дисципліни у використанні державного фонду сприяння зайнятості населення', 70 ],
      [ '08', 'Завищення вартості навчання незайнятих громадян', 80 ],
      [ '09', 'Відсутність контролю за роціональним використанням коштів Державного фонду сприяння зайнятості населення', 90 ],
      [ '10', 'Перевищення своїх повноважень‚ нетактовне‚ грубе та зверхне відношення до колег та підлеглих', 100 ],
      [ '11', 'Вчинок‚ який порочить державного службовця (ст. 14)', 110 ],
      [ '12', 'Невиконання службових обов’язків (ст. 14)', 120 ],
      [ '13', 'Заподіяння шкоди підприємству‚ установі‚ організації внаслідок порушення покладених на працівників трудових обов’язків (ст. 130 КЗпПУ)', 130 ],
      [ '14', 'Перевищення своїх повноважень (ст. 14)', 140 ],
      [ '15', 'Порушення обмежень‚ пов’язаних з проходженням державної служби (ст. 14)', 150 ],
      [ '16', 'Вчинок‚ який дискредитує державний орган‚ в якому працює державний службовець (ст. 14)', 160 ],
      [ '17', 'Невиконання службових обов’язків‚ що призвело до людських жертв (ст. 22)', 170 ],
      [ '18', 'Невиконання службових обов’язків‚ що заподіяло значної матеріальної шкоди (ст. 22)', 180 ],
      [ '19', 'Невиконання службових обов’язків‚ що заподіяло моральної шкоди (ст. 22)', 190 ],
      [ '20', 'Порушення трудової дисципліни (ст. 147 КЗпПУ)', 200 ],
      [ '21', '(не визначено)', 210 ],
      [ '-999', 'Імпортоване значення', 9999 ]
    ]
  }
]
