module.exports = [
  {
    entity: 'hr_methodExp',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: false,
    identifier: ['code'],
    attrs: [ 'code', 'name', 'algorithm' ],
    items: [
      ['1', 'Загальний стаж', 'workexp'],
      ['2', 'Неперервний стаж', 'salary'],
      ['3', 'Стаж в організації', 'inorg'],
      ['4', 'Страховий стаж', 'salary'],
      ['5', 'Галузевий стаж', 'salary'],
      ['6', 'Стаж державної служби', 'govexp'],
      ['7', 'Неперервний стаж державної служби', 'salary'],
      ['8', 'Спеціальний стаж', 'salary'],
      ['9', 'Відпустка по догляду за дитиною', 'salary'],
      ['10', 'Стаж у фінансовій системі', 'salary'],
      ['11', 'Безперервний стаж в організації', 'salary'],
      ['12', 'Стаж на керівних посадах в організації', 'salary'],
      ['13', 'Стаж в юридичній службі організації', 'salary'],
      ['14', 'Вислуга в державних органах ПО', 'salary'],
      ['15', 'Юридичний стаж', 'salary'],
      ['99', 'Метод не визначено', 'salary']
    ]
  }
]
