module.exports = [
  {
    entity: 'hr_dictPenalty',
    localeAttr: ['name', 'preamble', 'directive'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'idxNum', 'isActive', 'preamble', 'directive'],
    items: [
      [ '01', 'Догана', 10, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '02', 'Позбавлення премії (в мин. )', 20, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '03', 'Відсторонення від виконання повноважень', 30, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '04', 'Дострокове припинення депутатських повноважень', 40 ],
      [ '05', 'Затримка до одного року у призначенні на вищу посаду (захід)', 50, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '06', 'Затримка до одного року у присвоєнні чергового рангу (захід)', 60, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '07', 'Затримка у призначенні на вищу посаду', 70, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '08', 'Зауваження (в мин. )', 80, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '09', 'Звільнення', 90, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '10', 'Зміна терміну відпустки (в мин. )', 100, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '11', 'Зменшення тривалості відпустки (в мин. )', 110, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '12', 'Перенесення черги на житло (в мин. )', 120, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '13', 'Позбавлення винагороди по результатам року (в мин. )', 130, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '14', 'Позбавлення премії (в мин. )', 140, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '15', 'Попередження (в мин. )', 150, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '16', 'Попередження про неповну службову відповідність', 160, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '17', 'Попередження про неповну службову відповідність (захід)', 170, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '18', 'Розгляд на товариському суді (в мин. )', 180, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '19', 'Сувора догана (в мин. )', 190, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '20', 'Тимчасово переведено на менш оплачувану роботу (в мин. )', 200, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '21', 'Фінансове утримання (в мин. )', 210, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '22', 'Штраф за порушення правил техніки безпеки (в мин. )', 220, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ],
      [ '-999', 'Імпортоване значення', 9999, true, 'За поданням дисциплінарної комісії з розгляду дисциплінарних справ', 'НАКЛАСТИ ДИСЦИПЛІНАРНЕ СТЯГНЕННЯ у виді' ]
    ]
  }
]
