module.exports = [
  {
    entity: 'hr_dictTaskScore',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'score'],
    items: [
      [ '1', 'Завдання не виконане або в роботі порушено вимоги законодавства у сфері запобігання корупції', 0 ],
      [ '2', 'Завдання виконане частково, результати не можуть бути використані через необхідність суттєвого доопрацювання, до виконання завдання державний службовець підійшов формально, чим нівелював практичну цінність отриманого результату, або завдання виконане з демонстрацією неспроможності одночасного забезпечення на належному рівні і своєчасного виконання посадових обов’язків, або в роботі порушено вимоги правил етичної поведінки, або процес досягнення результату чи сам результат мав негативний відгук з боку користувачів, споживачів, співвиконавців, керівництва тощо', 1 ],
      [ '3', 'Завдання виконане частково, результати не можуть бути використані через необхідність суттєвого доопрацювання, до виконання завдання державний службовець підійшов формально, чим нівелював практичну цінність отриманого результату, або завдання виконане з демонстрацією неспроможності одночасного забезпечення на належному рівні і своєчасного виконання посадових обов’язків, або в роботі порушено вимоги правил етичної поведінки, або процес досягнення результату чи сам результат мав негативний відгук з боку користувачів, споживачів, співвиконавців, керівництва тощо', 2 ],
      [ '4', 'Завдання виконане своєчасно, результат якого повною мірою можна використати у роботі. Робота проводилась ефективно з дотриманням правил етичної поведінки', 3 ],
      [ '5', 'Завдання виконане своєчасно (завчасно), результат високої якості, його досягнуто з високим ступенем самостійності (за необхідності командної роботи), ініціативності, робота проводилась ефективно, з дотриманням правил етичної поведінки. Під час виконання завдання державним службовцем вносилися пропозиції щодо інших документів або їх удосконалення', 4 ]
    ]
  }
]
