module.exports = [
  {
    entity: 'hr_dictProfCompetency',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'groupCategory'],
    items: [
      ['01', 'Лідерство', '1'],
      ['02', 'Комунікація та взаємодія', '1'],
      ['03', 'Досягнення результатів', '1'],
      ['04', 'Стресостійкість', '1'],
      ['05', 'Абстрактне мислення', '1'],
      ['06', 'Лідерство', '2'],
      ['07', 'Комунікація та взаємодія', '2'],
      ['08', 'Досягнення результатів', '2'],
      ['09', 'Стресостійкість', '2'],
      ['10', 'Абстрактне мислення', '2']
    ]
  }
]
