module.exports = [
  {
    entity: 'hr_dictCompetency',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'psCategory'],
    items: [
      [ '1', 'Знання законодавства (Б)', '2' ],
      [ '2', 'Знання законодавства (В)', '3' ],
      [ '3', 'Професійні знання (Б)', '2' ],
      [ '4', 'Професійні знання (В)', '3' ],
      [ '5', 'Лідерство', '2' ],
      [ '6', 'Виконання на високому рівні поставлених завдань', '3' ],
      [ '7', 'Прийняття ефективних рішень', '2' ],
      [ '8', 'Командна робота та взаємодія', '3' ],
      [ '9', 'Комунікації та взаємодія', '2' ],
      [ '10', 'Сприйняття змін', '3' ],
      [ '11', 'Впровадження змін', '2' ],
      [ '12', 'Технічні вміння', '3' ],
      [ '13', 'Управління організацією роботи та персоналом', '2' ],
      [ '14', 'Особисті компетенції (Б)', '2' ],
      [ '15', 'Особисті компетенції (В)', '3' ]
    ]
  }
]
