module.exports = [
  {
    entity: 'hr_taxLimit',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_taxLimit').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['name'],
    attrs: ['code', 'name', 'taxLimitType', 'size', 'codeForReport'],
    items: [
      ['169.1.1', 'Базова пільга', '1', 1, '01'],
      ['169.1.2ВР', 'Другий з батьків - Пільга для осіб, що виховують двох та більше дітей до 18 років', '2', 1, '04'],
      ['169.1.4г', 'Пільга для вивезених під час війни', '1', 2, '03'],
      ['169.1.4а', 'Пільга для Героїв України, Героїв Радянського Союзу ...', '1', 2, '03'],
      ['169.1.3ґ', 'Пільга для інвалідів I - II групи в т.ч. дитинства', '1', 1.5, '02'],
      ['169.1.4в', `Пільга для колишніх в'язнів концтаборів ...`, '1', 2, '03'],
      ['169.1.3а', 'Пільга для одиноких матерів в розрахунку на кожну дитину', '2', 1.5, '02'],
      ['169.1.4ґ', 'Пільга для осіб, що перебували на блокадній території Ленінграда', '1', 2, '03'],
      ['169.1.2', 'Пільга для осіб, які утримують двох і більше дітей до 18 років', '2', 1, '04'],
      ['169.3.1', 'Пільга для осіб, які утримують двох і більше дітей до 18 років, у тому числі дитину-інваліда', '2', 1.00, '04'],
      ['169.1.3б', 'Пільга для осіб, які утримують дитину-інваліда I або II групи', '2', 1.5, '02'],
      ['169.1.4б', 'Пільга для учасників бойових дій під час Другої світової війни', '1', 2, '03'],
      ['169.1.3е', 'Пільга для учасників бойових дій після Другої світової війни', '1', 1.5, '02'],
      ['169.1.3в', 'Пільга для чорнобильців', '1', 1.5, '02'],
      ['612в', 'Пільга на трьох і більше дітей віком до 18 (на кожну дитину)', '2', 1.50, '02'],
      ['612г', 'Пільга осіб, які є вдівцем або вдовою', '1', 1.5, '02'],
      ['169.1.3д', 'Пільга особам, підлогу. стипендію за пересл., в т.ч. журналістам', '1', 1.5, '02'],
      ['169.1.3г', 'Пільга учням, студентам, аспірантам ...', '1', 1.5, '02']
    ]
  }
]
