module.exports = [
  {
    entity: 'hr_dictDisabilityType',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: 'code',
    attrs: ['code', 'name'],
    items: [
      ['1', 'Особа з інвалідністю з дитинства'],
      ['2', 'Особа з інвалідністю внаслідок труда'],
      ['3', 'Загальні захворювання'],
      ['4', "Захворювання пов'язане з ЧАЕС"],
      ['5', 'Трудове каліцтво'],
      ['6', 'Особа з інвалідністю внаслідок військової служби'],
      ['7', 'Особа з інвалідністю внаслідок війни'],
      ['8', "Захворювання пов'язане з захистом Батьківщини"]
    ]
  }
]
