module.exports = [
  {
    entity: 'hr_dictBenefitsKind',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictBenefitsKind').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['code'],
    attrs: ['code', 'name'],
    items: [
      ['01', 'Пенсіонер'],
      ['02', 'За віком на пільгових умовах'],
      ['05', 'За віком'],
      ['07', 'За вислугу років'],
      ['09', 'По інвалідності'],
      ['10', '(інвалід) Інвалід 1 групи'],
      ['11', '(інвалід) Інвалід 2 групи'],
      ['12', '(інвалід) Інвалід 3 групи'],
      ['13', '(пенсія) В разі втрати годувальника'],
      ['14', '(пенсія) За вислугу років'],
      ['15', '(пенсія) За віком'],
      ['16', '(пенсія) За віком багатодітним матерям і матерям інвалідів з дитинства'],
      ['17', '(пенсія) За віком на пільгових умовах'],
      ['18', '(пенсія) Офіцер запасу'],
      ['19', '(пенсія) По інвалідності'],
      ['20', '(пенсія) При неповному стажі роботи'],
      ['21', '(пенсія) Соціальна'],
      ['22', '(ЧАЕС) Категорія 1 - інваліди з числа учасників ліквідації аварії на ЧАЕС'],
      ['23', '(ЧАЕС) Категорія 2 - учасники ліквідації аварії на ЧАЕС'],
      ['24', '(ЧАЕС) Категорія 3 - діти‚ учасники ліквідації‚ потерпілі від аварії на ЧАЕС'],
      ['25', '(ЧАЕС) Категорія 4 - особи‚ які постійно проживають або постійно працюють на території зони посиленого радіоекологічного контролю'],
      ['28', 'Ветеран військової служби‚ військовий пенсіонер'],
      ['29', 'В разі втрати годувальника'],
      ['30', '(ЧАЕС) Категорія 2- громадянин‚ який евакуйований із зони відчуження у 1986 році'],
      ['31', 'Учасник бойових дій']
    ]
  }
]
