module.exports = [
  {
    entity: 'hr_dictBonusKind',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: 'code',
    attrs: ['code', 'name'],
    items: [
      ['01', 'Подяка'],
      ['02', 'Орден'],
      ['03', 'Почесний нагрудний знак'],
      ['04', 'Державна нагорода України'],
      ['05', 'Заохочувальна відзнака'],
      ['06', 'Медаль'],
      ['07', 'Грамота'],
      ['08', 'Цінний подарунок'],
      ['09', 'Премія'],
      ['10', 'Почесне звання'],
      ['11', 'Пам\'ятний нагрудний знак'],
      ['12', 'Чергове військове звання']
    ]
  }
]
