module.exports = [
  {
    entity: 'hr_dictTimeGroup',
    identifier: ['code'],
    notUpdate: true,
    localeAttr: ['name'],
    notDelete: true,
    attrs: ['code', 'name', 'isClose'],
    items: [
      ['LST_VACATION', 'Список "Працівники, які перебувають у відпустках"', 0],
      ['LST_CHD_CARE_VAC', 'Список "Працівники, які перебувають у довгострокових відпустках"', 0],
      ['LST_NONPAID_VAC', 'Список "Працівники, які перебувають у неоплачуваних відпустках"', 0],
      ['LST_TRIP', 'Список "Працівники, які перебувають у відрядженні"', 0],
      ['LST_AVG_STAFF_EXL', 'Виключення з середньооблікової чисельності для звіту ЄСВ', 0],
      ['LST_SICKNESS', 'Список "Працівники, які відсутні у зв"язку з хворобою"', 0],
      ['LST_AVGPAYMENT', 'Список "Працівники, які відсутні з виплатою по середньому за 2 місяці"', 0]
    ]
  }
]
