module.exports = [
  {
    entity: 'hr_dictRank',
    localeAttr: ['name', 'printName','printNameGen'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name', 'printName','printNameGen', 'nextRankMonth'],
    items: [
      ['1', 'Ранг 1', '1 (перший) ранг', '1 рангу', null],
      ['2', 'Ранг 2', '2 (другий) ранг', '2 рангу', 36],
      ['3', 'Ранг 3', '3 (третій) ранг', '3 рангу', 36],
      ['4', 'Ранг 4', '4 (четвертий) ранг', '4 рангу', 36],
      ['5', 'Ранг 5', '5 (пятий) ранг', '5 рангу', 36],
      ['6', 'Ранг 6', '6 (шостий) ранг', '6 рангу', 36],
      ['7', 'Ранг 7', '7 (сьомий) ранг', '7 рангу', 36],
      ['8', 'Ранг 8', '8 (восьмий) ранг', '8 рангу',36],
      ['9', 'Ранг 9', '9 (девятий) ранг', '9 рангу', 36],
      ['10', 'Ранг 10', '10 (десятий) ранг', '10 рангу', 36],
      ['11', 'Ранг 11', '11 (одинадцятий) ранг', '11 рангу', 36],
      ['12', 'Ранг 12', '12 (дванадцятий) ранг', '12 рангу', 36],
      ['13', 'Ранг 13', '13 (тринадцятий) ранг', '13 рангу', 36],
      ['14', 'Ранг 14', '14 (чотирнадцятий) ранг', '14 рангу', 36],
      ['15', 'Ранг 15', '15 (п’ятнадцятий) ранг', '15 рангу', 36]
    ]
  }
]
