module.exports = [
  {
    entity: 'hr_dictBonusType',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: 'code',
    attrs: ['code', 'name'],
    items: [
      ['01', 'Державна нагорода'],
      ['02', 'Відзнаки міністерств та відомств'],
      ['03', 'Кабінет Міністрів України'],
      ['04', 'Верховна Рада України'],
      ['05', 'Почесне звання'],
      ['06', 'Відзнака Міністерства оборони України'],
      ['07', 'Національне агенство України з питань державної служби'],
      ['08', 'Нагороди інших держав'],
      ['09', 'Відзнака Президента України']
    ]
  }
]
