module.exports = [
  {
    entity: 'hr_dictTaxIndivid',
    identifier: ['code'],
    notUpdate: true,
    localeAttr: ['name'],
    notDelete: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictTaxIndivid').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    attrs: ['code', 'codeReport', 'name', 'taxBreaks', 'priority'],
    items: [
      [101, 101, 'Заробітна плата', 1, 1],
      [102, 102, 'Договори ЦПХ', 0, 2],
      [103, 103, 'Авторська винагорода', 0, 3],
      [104, 104, 'Лікарняні ПФУ', 1, 7],
      [105, 105, 'Лікарняні ФОП', 1, 7],
      [109, 109, 'Дохід у вигляді дивідендів', 0, 4],
      [126, 126, 'Додаткове благо', 0, 5],
      [127, 127, 'Інші доходи', 0, 6],
      [128, 128, 'Соціальні допомоги', 1, 7],
      [140, 140, 'Аліменти', 0, 8],
      [146, 146, 'Допомога на поховання', 1, 9],
      [150, 150, 'Стипендія', 1, 1],
      [157, 157, 'Дохід, виплачений самозайнятій особі', 0, 10],
      [169, 169, 'Благодійна або гуманітарна допомога', 0, 11]
    ]
  }
]
