module.exports = [
  {
    entity: 'ac_dictRep',
    localeAttr: ['codeName', 'name'],
    notDelete: true,
    identifier: ['code', 'subCode', 'codeName'],
    attrs: ['code', 'subCode', 'repGroup', 'codeName', 'name', 'isFolder', 'isAdditional', 'mainParamsForm', 'isOrigin', 'model', 'autoUpdateSettingCalc'],
    items: [
      ['J05', '001', 'taxation', '1 ДФ', 'Податковий розрахунок сум доходу, нарахованого (сплаченого) на користь фізичних осіб, і сум утриманого з них податку', 0, 0, 'J0500108Params', 1, 'HR', 1],

      ['J30', '004', 'taxation', 'Додаток 4', 'Звіт про суми нарахованої заробітної плати (доходу, грошового забезпечення, допомоги, надбавки, компенсації) застрахованих осіб та суми нарахованого єдиного внеску на загальнообов’язкове державне соціальне страхування', 0, 0, 'J3000412Params', 1, 'HR', 0],
      ['J30', '401', 'taxation', 'Таблиця 1', 'Нарахування єдиного внеску', 0, 1, null, 1, 'HR', 1],
      ['J30', '402', 'taxation', 'Таблиця 2', `Нарахування єдиного внеску на загальнообов'язкове державне соціальне страхування за деякі категорії застрахованих осіб`, 0, 1, null, 1, 'HR', 0],
      ['J30', '403', 'taxation', 'Таблиця 3', `Нарахування єдиного внеску на загальнообов'язкове державне соціальне страхування за осіб, які проходять строкову військову службу`, 0, 1, null, 1, 'HR', 0],
      ['J30', '404', 'taxation', 'Таблиця 4', `Нарахування єдиного внеску на загальнообов'язкове державне соціальне страхування на суми грошового забезпечення та на суми допомоги у зв’язку з вагітністю та пологами`, 0, 1, null, 1, 'HR', 1],
      ['J30', '405', 'taxation', 'Таблиця 5', `Відомості про трудові відносини осіб та період проходження військової служби`, 0, 1, null, 1, 'HR', 0],
      ['J30', '406', 'taxation', 'Таблиця 6', `Відомості про нарахування заробітної плати (доходу, грошового забезпечення) застрахованим особам`, 0, 1, null, 1, 'HR', 1],
      ['J30', '407', 'taxation', 'Таблиця 7', `Наявність підстав для обліку стажу окремим категоріям осіб відповідно до законодавства`, 0, 1, null, 1, 'HR', 0],
      ['J30', '408', 'taxation', 'Таблиця 8', `Відомості про осіб, які доглядають за дитиною до досягнення нею трирічного віку та відповідно до закону отримують допомогу по догляду за дитиною до досягнення нею трирічного віку та/або при народженні дитини, при усиновленні дитини, та осіб із числа непрацюючих працездатних батьків, усиновителів, опікунів, піклувальників, які фактично здійснюють догляд за дитиною з інвалідністю`, 0, 1, null, 1, 'HR', 0],
      ['J30', '409', 'taxation', 'Таблиця 9', `Відомості про осіб, які проходять строкову військову службу`, 0, 1, null, 1, 'HR', 0],

      ['J05', '001', 'taxation', 'ПДФО_ЄСВ', 'Податковий розрахунок сум доходу, нарахованого (сплаченого) на користь платників податків - фізичних осіб, і сум утриманого з них податку, а також сум нарахованого єдиного внеску', 0, 0, 'J0500109Params', 1, 'HR', 1],
      ['J05', '101', 'taxation', 'Додаток 1', 'Таблиця 1. Відомості про нарахування заробітної плати (доходу, грошового забезпечення) застрахованим особам', 0, 1, null, 1, 'HR', 1],
      ['J05', '104', 'taxation', 'Додаток 4 ДФ', 'Таблиця 4 ДФ. Відомості про суми нарахованого доходу, утриманого та сплаченого податку на доходи фізичних осіб та військового збору', 0, 1, null, 1, 'HR', 1],
      ['J05', '105', 'taxation', 'Додаток 5', 'Таблиця 5. Відомості  про трудові відносини осіб та період проходження військової служби ', 0, 1, null, 1, 'HR', 1],
      ['J05', '106', 'taxation', 'Додаток 6', 'Таблиця 7. Відомості про наявність підстав для обліку стажу окремим категоріям осіб відповідно до законодавства', 0, 1, null, 1, 'HR', 1],

      ['J05', '001', 'taxation', 'ПДФО_ЄСВ_2025', 'Податковий розрахунок сум доходу, нарахованого (сплаченого) на користь платників податків - фізичних осіб, і сум утриманого з них податку, а також сум нарахованого єдиного внеску', 0, 0, 'J0500110Params', 1, 'HR', 1],

      ['S03', '010', 'statistical', '1-ПВ місячна', 'Звіт з праці (місячна)', 0, 0, 'S0301016Params', 1, 'HR', 1],
      ['S02', '201', 'statistical', 'Форма № 3-борг', 'Звіт про заборгованість з оплати праці щомісячний', 0, 0, 'S0220103Params', 1, 'HR', 1],
      ['S03', '011', 'statistical', '1-ПВ квартальна', 'Звіт з праці (квартальна)', 0, 0, 'S0301121Params', 1, 'HR', 1],
      ['H03', '010', 'statistical', 'Звіт у фонд ЧАЕС', '(місячна)', 0, 0, 'H0301011Params', 1, 'HR', 1],
      ['H01', '100', 'statistical', 'Форма № 10-ПОІ (річна)', 'Звіт про зайнятість і працевлаштування інвалідів', 0, 0, 'H0110003Params', 1, 'HR', 1],
      ['H01', '101', 'statistical', 'Додаток 1', 'Додаток 1', 0, 1, null, 1, 'HR', 0],

      ['C11', '001', 'fssu', 'Додаток 1', 'Заява-розрахунок для фінансування для надання матеріального забезпечення застрахованим особам за рахунок коштів Фонду', 0, 0, 'C1100101Params', 1, 'HR', 0],
      ['C11', '101', 'fssu', 'Додаток 1.1', 'І. Матеріальне забезпечення', 0, 1, null, 1, 'HR', 0],
      ['C11', '102', 'fssu', 'Додаток 1.2', 'ІІ Допомога на поховання', 0, 1, null, 1, 'HR', 0],
      ['C11', '103', 'fssu', 'Додаток 1.3', 'ІІІ. Нарахування допомоги по тимчасовій непрацездатності внаслідок нещасного випадку або профзахворювання', 0, 1, null, 1, 'HR', 0],
      ['C11', '104', 'fssu', 'Додаток 1.4', 'ІV. Нарахування виплати у разі переведення потерпілого на легшу, нижчеоплачувану роботу', 0, 1, null, 1, 'HR', 0],
      ['C11', '105', 'fssu', 'Додаток 1.5', 'V. Відшкодування вартості поховання потерпілого та пов’язаних з цим ритуальних послуг', 0, 1, null, 1, 'HR', 0],

      ['C11', '002', 'fssu', 'Додаток 2', 'Повідомлення про виплату коштів застрахованим особам', 0, 0, 'C1100201Params', 1, 'HR', 1],

      ['H02', '100', 'statistical', 'ІНФОРМАЦІЯ про зайнятість', 'ІНФОРМАЦІЯ про зайнятість і працевлаштування громадян, що мають додаткові гарантії у сприянні працевлаштуванню', 0, 0, 'H0210001Params', 1, 'HR', 1],
      ['H02', '101', 'statistical', 'Додаток 1', 'Додаток 1', 0, 1, null, 1, 'HR', 0],

      ['H04', '010', 'pf', '1ЗаяваПФ', 'Заява-розрахунок щодо сплати за листками непрацездатності застрахованих осіб', 0, 0, 'H0401001Params', 1, 'HR', 1],

      ['S03', '030', 'statistical', '1-РС', '1-РС Звіт про витрати на утримання робочої сили', 0, 0, 'S0303003Params', 1, 'HR', 1],
      ['S03', '007', 'statistical', '7ПВ', 'Звіт про заробітну плату за професіями окремих працівників', 0, 0, 'S0300703Params', 1, 'HR', 1],

      ['H05', '010', 'statistical', '7-ВК (Форма №1)', 'Про виплату компенсацій, допомоги та надання пільг громадянам, які постраждали внаслідок Чорнобильської катастрофи', 0, 0, 'H0501001Params', 1, 'HR', 1]
    ]
  },
  {
    entity: 'ac_dictRepDt',
    notUpdate: true,
    notDelete: true,
    identifier: ['dictRepID', 'dictRepAdditionalID'],
    attrsConfig: {
      dictRepID: function (value, params, conn, migrationParams) {
        return conn.Repository('ac_dictRep')
          .attrs('ID')
          .where('code', '=', String(params.code))
          .where('subCode', '=', String(params.subCode))
          .where('codeName', '=', migrationParams.allLocales[String(value)] || String(value))
          .selectScalar()
      },
      dictRepAdditionalID: function (value, params, conn, migrationParams) {
        return conn.Repository('ac_dictRep')
          .attrs('ID')
          .where('code', '=', String(params.codeAdditional))
          .where('subCode', '=', String(params.subCodeAdditional))
          .where('codeName', '=', migrationParams.allLocales[String(value)] || String(value))
          .selectScalar()
      }
    },
    ignoreAttrs: ['code', 'subCode', 'codeAdditional', 'subCodeAdditional'],
    attrs: ['lineNum', 'code', 'subCode', 'dictRepID', 'codeAdditional', 'subCodeAdditional', 'dictRepAdditionalID'],
    items: [
      [1, 'J30', '004', 'Додаток 4', 'J30', '401', 'Таблиця 1'],
      [2, 'J30', '004', 'Додаток 4', 'J30', '402', 'Таблиця 2'],
      [3, 'J30', '004', 'Додаток 4', 'J30', '403', 'Таблиця 3'],
      [4, 'J30', '004', 'Додаток 4', 'J30', '404', 'Таблиця 4'],
      [5, 'J30', '004', 'Додаток 4', 'J30', '405', 'Таблиця 5'],
      [6, 'J30', '004', 'Додаток 4', 'J30', '406', 'Таблиця 6'],
      [7, 'J30', '004', 'Додаток 4', 'J30', '407', 'Таблиця 7'],
      [8, 'J30', '004', 'Додаток 4', 'J30', '408', 'Таблиця 8'],
      [9, 'J30', '004', 'Додаток 4', 'J30', '409', 'Таблиця 9'],

      [1, 'C11', '001', 'Додаток 1', 'C11', '101', 'Додаток 1.1'],
      [2, 'C11', '001', 'Додаток 1', 'C11', '102', 'Додаток 1.2'],
      [3, 'C11', '001', 'Додаток 1', 'C11', '103', 'Додаток 1.3'],
      [4, 'C11', '001', 'Додаток 1', 'C11', '104', 'Додаток 1.4'],
      [5, 'C11', '001', 'Додаток 1', 'C11', '105', 'Додаток 1.5'],

      [1, 'J05', '001', 'ПДФО_ЄСВ', 'J05', '101', 'Додаток 1'],
      [2, 'J05', '001', 'ПДФО_ЄСВ', 'J05', '104', 'Додаток 4 ДФ'],
      [3, 'J05', '001', 'ПДФО_ЄСВ', 'J05', '105', 'Додаток 5'],
      [4, 'J05', '001', 'ПДФО_ЄСВ', 'J05', '106', 'Додаток 6'],

      [1, 'J05', '001', 'ПДФО_ЄСВ_2025', 'J05', '101', 'Додаток 1'],
      [2, 'J05', '001', 'ПДФО_ЄСВ_2025', 'J05', '104', 'Додаток 4 ДФ'],
      [3, 'J05', '001', 'ПДФО_ЄСВ_2025', 'J05', '105', 'Додаток 5'],
      [4, 'J05', '001', 'ПДФО_ЄСВ_2025', 'J05', '106', 'Додаток 6'],

      [1, 'H01', '100', 'Форма № 10-ПОІ (річна)', 'H01', '101', 'Додаток 1'],
      [1, 'H02', '100', 'ІНФОРМАЦІЯ про зайнятість', 'H02', '101', 'Додаток 1']
    ]
  },
  {
    entity: 'ac_dictRepPeriod',
    notUpdate: true,
    notDelete: true,
    identifier: ['dictRepID', 'dictRepTypeID'],
    attrsConfig: {
      dictRepID: function (value, params, conn, migrationParams) {
        return conn.Repository('ac_dictRep')
          .attrs('ID')
          .where('code', '=', String(params.code))
          .where('subCode', '=', String(params.subCode))
          .where('codeName', '=', migrationParams.allLocales[String(value)] || String(value))
          .selectScalar()
      },
      dictRepTypeID: { associatedEntity: 'ac_dictRepType', codeAttr: 'code' }
    },
    ignoreAttrs: ['code', 'subCode'],
    attrs: ['code', 'subCode', 'dictRepID', 'dictRepTypeID'],
    items: [
      ['J05', '001', '1 ДФ', 4], ['J05', '001', '1 ДФ', 8], ['J05', '001', '1 ДФ', 13], ['J05', '001', '1 ДФ', 18],

      ['J30', '004', 'Додаток 4', 1], ['J30', '004', 'Додаток 4', 2], ['J30', '004', 'Додаток 4', 3], ['J30', '004', 'Додаток 4', 5],
      ['J30', '004', 'Додаток 4', 6], ['J30', '004', 'Додаток 4', 7], ['J30', '004', 'Додаток 4', 10], ['J30', '004', 'Додаток 4', 11],
      ['J30', '004', 'Додаток 4', 12], ['J30', '004', 'Додаток 4', 15], ['J30', '004', 'Додаток 4', 16], ['J30', '004', 'Додаток 4', 17],

      ['S03', '010', '1-ПВ місячна', 1], ['S03', '010', '1-ПВ місячна', 2], ['S03', '010', '1-ПВ місячна', 3],
      ['S03', '010', '1-ПВ місячна', 5], ['S03', '010', '1-ПВ місячна', 6], ['S03', '010', '1-ПВ місячна', 7],
      ['S03', '010', '1-ПВ місячна', 10], ['S03', '010', '1-ПВ місячна', 11], ['S03', '010', '1-ПВ місячна', 12],
      ['S03', '010', '1-ПВ місячна', 15], ['S03', '010', '1-ПВ місячна', 16], ['S03', '010', '1-ПВ місячна', 17],

      ['S02', '201', 'Форма № 3-борг', 1], ['S02', '201', 'Форма № 3-борг', 2], ['S02', '201', 'Форма № 3-борг', 3],
      ['S02', '201', 'Форма № 3-борг', 5], ['S02', '201', 'Форма № 3-борг', 6], ['S02', '201', 'Форма № 3-борг', 7],
      ['S02', '201', 'Форма № 3-борг', 10], ['S02', '201', 'Форма № 3-борг', 11], ['S02', '201', 'Форма № 3-борг', 12],
      ['S02', '201', 'Форма № 3-борг', 15], ['S02', '201', 'Форма № 3-борг', 16], ['S02', '201', 'Форма № 3-борг', 17],

      ['H03', '010', 'Звіт у фонд ЧАЕС', 1], ['H03', '010', 'Звіт у фонд ЧАЕС', 2], ['H03', '010', 'Звіт у фонд ЧАЕС', 3],
      ['H03', '010', 'Звіт у фонд ЧАЕС', 5], ['H03', '010', 'Звіт у фонд ЧАЕС', 6], ['H03', '010', 'Звіт у фонд ЧАЕС', 7],
      ['H03', '010', 'Звіт у фонд ЧАЕС', 10], ['H03', '010', 'Звіт у фонд ЧАЕС', 11], ['H03', '010', 'Звіт у фонд ЧАЕС', 12],
      ['H03', '010', 'Звіт у фонд ЧАЕС', 15], ['H03', '010', 'Звіт у фонд ЧАЕС', 16], ['H03', '010', 'Звіт у фонд ЧАЕС', 17],

      ['H01', '100', 'Форма № 10-ПОІ (річна)', 20],
      ['H02', '100', 'ІНФОРМАЦІЯ про зайнятість', 20],

      ['S03', '011', '1-ПВ квартальна', 4], ['S03', '011', '1-ПВ квартальна', 8], ['S03', '011', '1-ПВ квартальна', 13], ['S03', '011', '1-ПВ квартальна', 18],

      ['C11', '001', 'Додаток 1', 1], ['C11', '001', 'Додаток 1', 2], ['C11', '001', 'Додаток 1', 3], ['C11', '001', 'Додаток 1', 5],
      ['C11', '001', 'Додаток 1', 6], ['C11', '001', 'Додаток 1', 7], ['C11', '001', 'Додаток 1', 10], ['C11', '001', 'Додаток 1', 11],
      ['C11', '001', 'Додаток 1', 12], ['C11', '001', 'Додаток 1', 15], ['C11', '001', 'Додаток 1', 16], ['C11', '001', 'Додаток 1', 17],

      ['C11', '002', 'Додаток 2', 1], ['C11', '002', 'Додаток 2', 2], ['C11', '002', 'Додаток 2', 3], ['C11', '002', 'Додаток 2', 5],
      ['C11', '002', 'Додаток 2', 6], ['C11', '002', 'Додаток 2', 7], ['C11', '002', 'Додаток 2', 10], ['C11', '002', 'Додаток 2', 11],
      ['C11', '002', 'Додаток 2', 12], ['C11', '002', 'Додаток 2', 15], ['C11', '002', 'Додаток 2', 16], ['C11', '002', 'Додаток 2', 17],

      ['J05', '001', 'ПДФО_ЄСВ', 4], ['J05', '001', 'ПДФО_ЄСВ', 8], ['J05', '001', 'ПДФО_ЄСВ', 13], ['J05', '001', 'ПДФО_ЄСВ', 18],

      ['J05', '001', 'ПДФО_ЄСВ_2025', 1], ['J05', '001', 'ПДФО_ЄСВ_2025', 2], ['J05', '001', 'ПДФО_ЄСВ_2025', 3], ['J05', '001', 'ПДФО_ЄСВ_2025', 5],
      ['J05', '001', 'ПДФО_ЄСВ_2025', 6], ['J05', '001', 'ПДФО_ЄСВ_2025', 7], ['J05', '001', 'ПДФО_ЄСВ_2025', 10], ['J05', '001', 'ПДФО_ЄСВ_2025', 11],
      ['J05', '001', 'ПДФО_ЄСВ_2025', 12], ['J05', '001', 'ПДФО_ЄСВ_2025', 15], ['J05', '001', 'ПДФО_ЄСВ_2025', 16], ['J05', '001', 'ПДФО_ЄСВ_2025', 17],

      ['H04', '010', '1ЗаяваПФ', 1], ['H04', '010', '1ЗаяваПФ', 2], ['H04', '010', '1ЗаяваПФ', 3],
      ['H04', '010', '1ЗаяваПФ', 5], ['H04', '010', '1ЗаяваПФ', 6], ['H04', '010', '1ЗаяваПФ', 7],
      ['H04', '010', '1ЗаяваПФ', 10], ['H04', '010', '1ЗаяваПФ', 11], ['H04', '010', '1ЗаяваПФ', 12],
      ['H04', '010', '1ЗаяваПФ', 15], ['H04', '010', '1ЗаяваПФ', 16], ['H04', '010', '1ЗаяваПФ', 17],

      ['S03', '030', '1-РС', 20],
      ['S03', '007', '7ПВ', 20],

      ['H05', '010', '7-ВК (Форма №1)', 4], ['H05', '010', '7-ВК (Форма №1)', 8], ['H05', '010', '7-ВК (Форма №1)', 13],
      ['H05', '010', '7-ВК (Форма №1)', 18], ['H05', '010', '7-ВК (Форма №1)', 9], ['H05', '010', '7-ВК (Форма №1)', 19],
      ['H05', '010', '7-ВК (Форма №1)', 20]
    ]
  },
  {
    entity: 'ac_dictRepVersion',
    notUpdate: false,
    notDelete: true,
    identifier: ['code', 'subCode', 'version'],
    attrsConfig: {
      dictRepID: function (value, params, conn, migrationParams) {
        return conn.Repository('ac_dictRep')
          .attrs('ID')
          .where('code', '=', String(params.code))
          .where('subCode', '=', String(params.subCode))
          .where('codeName', '=', migrationParams.allLocales[String(value)] || String(value))
          .selectScalar()
      }
    },
    attrs: ['code', 'subCode', 'version', 'dictRepID', 'dateFrom', 'dateTo'],
    items: [
      ['J30', '004', '12', 'Додаток 4', '2017-01-01T00:00:00Z', null],
      ['J30', '401', '12', 'Таблиця 1', '2017-01-01T00:00:00Z', null],
      ['J30', '402', '12', 'Таблиця 2', '2017-01-01T00:00:00Z', null],
      ['J30', '403', '12', 'Таблиця 3', '2017-01-01T00:00:00Z', null],
      ['J30', '404', '12', 'Таблиця 4', '2017-01-01T00:00:00Z', null],
      ['J30', '405', '12', 'Таблиця 5', '2017-01-01T00:00:00Z', null],
      ['J30', '406', '12', 'Таблиця 6', '2017-01-01T00:00:00Z', null],
      ['J30', '407', '12', 'Таблиця 7', '2017-01-01T00:00:00Z', null],
      ['J30', '408', '12', 'Таблиця 8', '2017-01-01T00:00:00Z', null],
      ['J30', '409', '12', 'Таблиця 9', '2017-01-01T00:00:00Z', null],

      ['J05', '001', '05', '1 ДФ', '2017-01-01T00:00:00Z', '2020-12-31T00:00:00Z'],

      ['H03', '010', '11', 'Звіт у фонд ЧАЕС', '2017-01-01T00:00:00Z', null],

      ['H01', '100', '01', 'Форма № 10-ПОІ (річна)', '2001-01-01T00:00:00Z', '2022-12-31T00:00:00Z'],
      ['H01', '100', '03', 'Форма № 10-ПОІ (річна)', '2023-01-01T00:00:00Z', null],

      ['H01', '101', '01', 'Додаток 1', '2001-01-01T00:00:00Z', null],

      ['H02', '100', '01', 'ІНФОРМАЦІЯ про зайнятість', '2001-01-01T00:00:00Z', null],
      ['H02', '101', '01', 'Додаток 1', '2001-01-01T00:00:00Z', null],

      ['S03', '010', '11', '1-ПВ місячна', '2017-01-01T00:00:00Z', '2020-12-31T00:00:00Z'],
      ['S03', '010', '12', '1-ПВ місячна', '2021-01-01T00:00:00Z', '2021-12-31T00:00:00Z'],
      ['S03', '010', '13', '1-ПВ місячна', '2022-01-01T00:00:00Z', '2022-12-31T00:00:00Z'],
      ['S03', '010', '14', '1-ПВ місячна', '2023-01-01T00:00:00Z', '2023-12-31T00:00:00Z'],
      ['S03', '010', '15', '1-ПВ місячна', '2024-01-01T00:00:00Z', '2024-12-31T00:00:00Z'],
      ['S03', '010', '16', '1-ПВ місячна', '2025-01-01T00:00:00Z', null],

      ['S02', '201', '01', 'Форма № 3-борг', '2021-01-01T00:00:00Z', '2021-12-31T00:00:00Z'],
      ['S02', '201', '02', 'Форма № 3-борг', '2022-01-01T00:00:00Z', '2022-12-31T00:00:00Z'],
      ['S02', '201', '03', 'Форма № 3-борг', '2023-01-01T00:00:00Z', null],

      ['S03', '011', '14', '1-ПВ квартальна', '2017-01-01T00:00:00Z', '2018-12-31T23:59:59Z'],
      ['S03', '011', '15', '1-ПВ квартальна', '2019-01-01T00:00:00Z', '2020-01-31T00:00:00Z'],
      ['S03', '011', '16', '1-ПВ квартальна', '2020-02-01T00:00:00Z', '2020-12-31T23:59:59Z'],
      ['S03', '011', '17', '1-ПВ квартальна', '2021-01-01T00:00:00Z', '2021-12-31T23:59:59Z'],
      ['S03', '011', '18', '1-ПВ квартальна', '2022-01-01T00:00:00Z', '2022-12-31T23:59:59Z'],
      ['S03', '011', '19', '1-ПВ квартальна', '2023-01-01T00:00:00Z', '2023-12-31T00:00:00Z'],
      ['S03', '011', '20', '1-ПВ квартальна', '2024-01-01T00:00:00Z', '2024-12-31T00:00:00Z'],
      ['S03', '011', '21', '1-ПВ квартальна', '2025-01-01T00:00:00Z', null],

      ['C11', '001', '01', 'Додаток 1', '2017-01-01T00:00:00Z', null],
      ['C11', '101', '01', 'Додаток 1.1', '2017-01-01T00:00:00Z', null],
      ['C11', '102', '01', 'Додаток 1.2', '2017-01-01T00:00:00Z', null],
      ['C11', '103', '01', 'Додаток 1.3', '2017-01-01T00:00:00Z', null],
      ['C11', '104', '01', 'Додаток 1.4', '2017-01-01T00:00:00Z', null],
      ['C11', '105', '01', 'Додаток 1.5', '2017-01-01T00:00:00Z', null],

      ['C11', '002', '01', 'Додаток 2', '2017-01-01T00:00:00Z', null],

      ['J05', '001', '06', 'ПДФО_ЄСВ', '2021-01-01T00:00:00Z', '2021-09-21T00:00:00Z'],
      ['J05', '101', '06', 'Додаток 1', '2021-01-01T00:00:00Z', '2021-09-21T00:00:00Z'],
      ['J05', '104', '06', 'Додаток 4 ДФ', '2021-01-01T00:00:00Z', '2021-09-21T00:00:00Z'],
      ['J05', '105', '06', 'Додаток 5', '2021-01-01T00:00:00Z', '2021-09-21T00:00:00Z'],
      ['J05', '106', '06', 'Додаток 6', '2021-01-01T00:00:00Z', '2021-09-21T00:00:00Z'],

      ['J05', '001', '07', 'ПДФО_ЄСВ', '2021-09-22T00:00:00Z', '2022-09-30T00:00:00Z'],
      ['J05', '101', '07', 'Додаток 1', '2021-09-22T00:00:00Z', '2022-09-30T00:00:00Z'],
      ['J05', '104', '07', 'Додаток 4 ДФ', '2021-09-22T00:00:00Z', '2022-09-30T00:00:00Z'],
      ['J05', '105', '07', 'Додаток 5', '2021-09-22T00:00:00Z', '2022-09-30T00:00:00Z'],
      ['J05', '106', '07', 'Додаток 6', '2021-09-22T00:00:00Z', '2022-09-30T00:00:00Z'],

      ['J05', '001', '08', 'ПДФО_ЄСВ', '2022-10-01T00:00:00Z', '2023-09-30T00:00:00Z'],
      ['J05', '101', '08', 'Додаток 1', '2022-10-01T00:00:00Z', '2023-09-30T00:00:00Z'],
      ['J05', '104', '08', 'Додаток 4 ДФ', '2022-10-01T00:00:00Z', '2023-09-30T00:00:00Z'],
      ['J05', '105', '08', 'Додаток 5', '2022-10-01T00:00:00Z', '2023-09-30T00:00:00Z'],
      ['J05', '106', '08', 'Додаток 6', '2022-10-01T00:00:00Z', '2023-09-30T00:00:00Z'],

      ['J05', '001', '09', 'ПДФО_ЄСВ', '2023-10-01T00:00:00Z', null],
      ['J05', '101', '09', 'Додаток 1', '2023-10-01T00:00:00Z', null],
      ['J05', '104', '09', 'Додаток 4 ДФ', '2023-10-01T00:00:00Z', null],
      ['J05', '105', '09', 'Додаток 5', '2023-10-01T00:00:00Z', null],
      ['J05', '106', '09', 'Додаток 6', '2023-10-01T00:00:00Z', null],

      ['J05', '001', '10', 'ПДФО_ЄСВ_2025', '2025-01-01T00:00:00Z', null],
      ['J05', '101', '10', 'Додаток 1', '2025-01-01T00:00:00Z', null],
      ['J05', '104', '10', 'Додаток 4 ДФ', '2025-01-01T00:00:00Z', null],
      ['J05', '105', '10', 'Додаток 5', '2025-01-01T00:00:00Z', null],
      ['J05', '106', '10', 'Додаток 6', '2025-01-01T00:00:00Z', null],

      ['H04', '010', '01', '1ЗаяваПФ', '2023-01-01T00:00:00Z', null],

      ['S03', '030', '03', '1-РС', '2023-01-01T00:00:00Z', null],
      ['S03', '007', '03', '7ПВ', '2023-01-01T00:00:00Z', null],
      ['H05', '010', '01', '7-ВК (Форма №1)', '2023-01-01T00:00:00Z', null]
    ]
  }
]
