module.exports = [
  {
    entity: 'tim_timeSheetPrintSettings',
    localeAttr: ['name', 'nameAdd'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('tim_timeSheetPrintSettings').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    attrsConfig: {
      dictTimePrintID: { associatedEntity: 'hr_dictTimePrint', codeAttr: 'code' }
    },
    identifier: ['code'],
    attrs: ['code', 'paramType', 'dictTimePrintID', 'name', 'nameAdd', 'orderN'],
    items: [
      [ '1', '2', '1', 'відрядження', 'ВД (код 07)', 1 ],
      [ '2', '2', '2', 'основні щорічні відпустки', 'В (код 08)', 2 ],
      [ '3', '2', '3', 'щорічна додаткова відпустка', 'Д (код 09)', 3 ],
      [ '4', '2', '4', 'додаткова відпустка у звязку з навчанням', 'Н (код 12)', 4 ],
      [ '5', '2', '5', 'додаткова оплачувана відпустка працівникам, які мають дітей', 'ДО (код 15)', 5 ],
      [ '6', '2', '6', 'відпустка у звязку з вагітністю та пологами або по догляду за дитиною до 3-х років', 'ВП (код 16)', 6 ],
      [ '7', '2', '7', 'відпустка по догляду за дитиною до 6-ти років', 'ДД (код 17)', 7 ],
      [ '8', '2', '8', 'відпустка без збереження заробітної плати за згодою сторін', 'НА (код 18)', 8 ],
      [ '9', '2', '9', 'день відпочинку за роботу у вихідний день', 'ІН (код 22)', 9 ],
      [ '10', '2', '10', 'курси підвищення кваліфікації', 'ІН (код 22)', 10 ],
      [ '11', '2', '11', 'оплата по середньому заробітку мобілізованим працівникам, контракт', 'ІН (код 22)', 11 ],
      [ '12', '2', '12', 'оплачувана тимчасова непрацездатність', 'ТН (код 26)', 12 ],
      [ '13', '2', '13', 'неоплачувана тимчасова непрацездатність', 'НН (код 27)', 13 ],
      [ '14', '2', '14', 'інші', 'інші', 14 ],
      [ '15', '2', '15', null, null, 15 ]
    ]
  }
]
