module.exports = [
  {
    entity: 'hr_payEl',
    identifier: ['code'],
    notUpdate: true,
    localeAttr: ['name', 'printName', 'genName', 'orName', 'shortPrintName'],
    notDelete: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_payEl').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    attrsConfig: {
      methodID: { associatedEntity: 'hr_method', codeAttr: 'code' },
      dictTimeCostID: { associatedEntity: 'hr_dictTimeCost', codeAttr: 'code' },
      dictExperienceID: { associatedEntity: 'hr_dictExperience', codeAttr: 'code' },
      dictTimeCostWorkID: { associatedEntity: 'hr_dictTimeCost', codeAttr: 'code' },
      dictTimeCostAvgID: { associatedEntity: 'hr_dictTimeCost', codeAttr: 'code' }
    },
    attrs: ['code', 'name', 'printName', 'genName', 'orName', 'shortPrintName', 'methodID', 'isAutoCalc', 'isRecalculate',
      'roundUpTo', 'calcProportion', 'calcSumType', 'periodType', 'calcMounth', 'roundAverage', 'dictTimeCostID',
      'dictExperienceID', 'includeSecondJobs', 'dictTimeCostWorkID', 'dictTimeCostAvgID', 'roundAvgUpTo', 'ignoreInCalcPay',
      'calcAvgType', 'includeInCalcAvg', 'calcTimeProportion', 'dayEarningType'
    ],
    items: [
      ['1', 'Оклад', 'оклад', 'окладу', 'окладом', 'оклад', '1', 1, 1, '1', 'HOUR', null, null, null, 0, 'РбДн', null, 0, null, null, '1', 0, null, null, null, null],
      ['2', 'Оплата за тарифом', 'оплату за тарифом', 'оплати за тарифом', 'оплатою за тарифом', 'опл.тар.', '2', 1, 1, '1', 'HOUR', null, null, null, 0, 'РбДн', null, 0, null, null, '1', 0, null, null, null, null],
      ['4', 'Постійна надбавка', 'постійну надбавку', 'постійної надбавки', 'постійною надбавкою', 'пост.надб.', '4', 1, 1, '1', null, 'PLAN', null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['3', 'Оплата за договором ЦПХ', 'оплату за договором ЦПХ', 'оплати за договором ЦПХ', 'оплатою за договором ЦПХ', 'опл.дог.ЦПХ', '3', 0, 0, '1', null, null, null, null, 0, 'РбДн', null, 0, null, null, '1', 0, null, null, null, null],
      ['5', 'Надбавка за ранг', 'надбавку за ранг', 'надбавки за ранг', 'надбавкою за ранг', 'надб.ранг', '5', 1, 1, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['6', 'Надбавка за вислугу років', 'надбавку за вислугу років', 'надбавки за вислугу років', 'надбавкою за вислугу років', 'надб.висл.р', '6', 1, 1, '1', null, 'PLAN', 'CALC', null, 0, null, '1', 0, null, null, '1', 0, null, null, null, null],
      ['7', 'Доплата за роботу у вечірній час', 'доплату за роботу у вечірній час', 'доплати за роботу у вечірній час', 'доплатою за роботу у вечірній час', 'допл.веч.час', '7', 1, 1, '1', 'HOUR', null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['8', 'Доплата за роботу у нічний час', 'доплату за роботу у нічний час', 'доплати за роботу у нічний час', 'доплатою за роботу у нічний час', 'допл.нічн.час', '8', 1, 1, '1', 'HOUR', null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['9', 'Доплата за роботу в надурочний час', 'доплату за роботу в надурочний час', 'доплати за роботу в надурочний час', 'доплатою за роботу в надурочний час', 'допл.надурочн.час', '9', 1, 1, '1', 'HOUR', null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['10', 'Доплата за роботу в святковий день', 'доплату за роботу в святковий день', 'доплати за роботу в святковий день', 'доплатою за роботу в святковий день', 'допл.святк.час', '10', 1, 1, '1', 'HOUR', null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['11', 'Оплата за роботу у вихідний день', 'оплату за роботу у вихідний день', 'оплати за роботу у вихідний день', 'оплатою за роботу у вихідний день', 'опл.вих.день', '11', 1, 1, '1', 'HOUR', null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['12', 'Щомісячна премія', 'щомісячну премію', 'щомісячної премії', 'щомісячною премією', 'щоміс.премія', '12', 1, 1, '1', null, null, 'CALC', null, 0, null, null, 0, null, null, '1', 0, null, '1', null, null],
      ['13', 'Відпустка', 'відпустку', 'відпустки', 'відпусткою', 'відпустка', '13', 0, 0, '1', null, null, null, 12, 1, 'Восн', null, 0, null, null, '1', 0, null, null, null, null],
      ['14', 'Відпустка по догляду за дитиною до 3-х років', 'відпустку по догляду за дитиною до 3-х років', 'відпустки по догляду за дитиною до 3-х років', 'відпусткою по догляду за дитиною до 3-х років', 'відп.дит.до 3-х р.', '14', 0, 0, '1', null, null, null, null, 1, 'В3дит', null, 0, null, null, '1', 0, null, null, null, null],
      ['15', 'Відпустка без утримання', 'відпустку без утримання', 'відпустки без утримання', 'відпусткою без утримання', 'відп. без утр.', '15', 0, 0, '1', null, null, null, null, 1, 'Взст', null, 0, null, null, '1', 0, null, null, null, null],
      ['16', 'Компенсація відпустки', 'компенсацію відпустки', 'компенсації відпустки', 'компенсацією відпустки', 'компенсац.відп.', '16', 0, 0, '1', null, null, null, 12, 1, null, null, 0, null, null, '1', 0, null, null, null, null],

      ['17', 'Лікарняний за рахунок ФОП', 'лікарняний за рахунок ФОП', 'лікарняного за рахунок ФОП', 'лікарняним за рахунок ФОП', 'лікарн.рах.ФОП', '17', 0, 0, '1', null, null, null, 12, 1, 'ЛікХвор', '4', 0, null, null, '1', 0, null, null, null, null],
      ['18', 'Лікарняний за рахунок СС', 'лікарняний за рахунок СС', 'лікарняного за рахунок СС', 'лікарняним за рахунок СС', 'лікарн.рах.СС', '18', 0, 0, '1', null, null, null, 12, 1, 'ЛікХвор', '4', 0, null, null, '1', 0, null, null, null, null],
      ['19', 'Лікарняні по догляду', 'лікарняні по догляду', 'лікарняних по догляду', 'лікарняними по догляду', 'лікарня.догл.', '19', 0, 0, '1', null, null, null, 12, 1, 'ЛікДогл', '4', 0, null, null, '1', 0, null, null, null, null],
      ['20', 'Лікарняні за вагітністю', 'лікарняні за вагітністю', 'лікарняних за вагітністю', 'лікарняними за вагітністю', 'лікарн.вагітн.', '20', 0, 0, '1', null, null, null, 12, 1, 'ЛікДогл', '4', 0, null, null, '1', 0, null, null, null, null],
      ['21', 'Відрядження', 'відрядження', 'відрядження', 'відрядженням', 'відрядження', '21', 0, 0, '1', null, null, null, 2, 1, 'Вдр', null, 0, 'ВдрР', 'ВдрС', '1', 0, null, null, null, 'PLANAVTO'],
      ['22', 'Вихідна допомога', 'вихідну допомогу', 'вихідної допомоги', 'вихідною допомогою', 'вих.допомога', '22', 0, 0, '1', null, null, null, 2, 1, 'НеявкаІн', null, 0, null, null, '1', 0, null, null, null, null],
      ['23', 'Державні обов\'язки (оплата за середнім заробітком)', 'державні обов\'язки (оплата за середнім заробітком)', 'державних обов\'язків (оплата за середнім заробітком)', 'державним обов\'язком (оплата за середнім заробітком)', 'держ.обов', '23', 0, 0, '1', null, null, null, 2, 1, 'НеявкаІн', null, 0, null, null, '1', 0, null, null, null, null],
      ['24', 'Індексація доходу', 'індексацію доходу', 'індексації доходу', 'індексацією доходу', 'інд.доходу', '24', 1, 1, '1', null, 'PLAN', null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['25', 'Доплата до мінімальної зарплати', 'доплату до мінімальної зарплати', 'доплати до мінімальної зарплати', 'доплатою до мінімальної зарплати', 'допл.мін.зп', '25', 1, 1, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['26', 'ПДФО', 'ПДФО', 'ПДФО', 'ПДФО', 'ПДФО', '26', 1, 1, '1', null, null, 'SALARY', null, 0, null, null, 1, null, null, '1', 0, null, null, null, null],
      ['27', 'Військовий збір', 'військовий збір', 'військового збору', 'військовим збором', 'військ. збір', '27', 1, 1, '1', null, null, 'SALARY', null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['28', 'Виплата заробітної плати', 'виплату заробітної плати', 'виплати заробітної плати', 'виплатою заробітної плати', 'виплата зп', '28', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['29', 'Аванс', 'аванс', 'авансу', 'авансом', 'аванс', '29', 1, 1, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['30', 'Виплата у міжрозрахунковий період', 'виплату у міжрозрахунковий період', 'виплати у міжрозрахунковий період', 'виплатою у міжрозрахунковий період', 'випл.міжрозр.пер.', '30', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['31', 'Аліменти', 'аліменти', 'аліментів', 'аліментами', 'аліменти', '31', 1, 1, '1', null, null, 'CALC', null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['32', 'Профспілковий внесок', 'профспілковий внесок', 'профспілкового внеску', 'профспілковим внеском', 'профспіл.внесок', '32', 1, 1, '1', null, null, 'SALARY', null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['33', 'Доплата за заміщення', 'доплату за заміщення', 'доплати за заміщення', 'доплатою за заміщення', 'допл. заміщ.', '33', 1, 1, '1', null, 'PLAN', null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['36', 'Матеріальна допомога', 'матеріальну допомогу', 'матеріальної допомоги', 'матеріальною допомогою', 'мат. допомога', '36', 0, 1, '1', null, 'FACT', null, 2, 1, null, null, 0, null, null, '1', 0, 'AVG', null, null, null],
      ['37', 'Матеріальна допомога на оздоровлення', 'матеріальну допомогу на оздоровлення', 'матеріальної допомоги на оздоровлення', 'матеріальною допомогою на оздоровлення', 'мат.доп.оздоров.', '37', 0, 0, '1', null, 'FACT', null, 2, 1, null, null, 0, null, null, '1', 0, 'AVG', null, null, null],
      ['38', 'Матеріальна допомога на поховання за рахунок СС', 'матеріальну допомогу на поховання за рахунок СС', 'матеріальної допомоги на поховання за рахунок СС', 'матеріальною допомогою на поховання за рахунок СС', 'мат.доп.поховання.СС', '38', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['40', 'Лікарняні за травматизмом', 'лікарняні за травматизмом', 'лікарняних за травматизмом', 'лікарняними за травматизмом', 'лікарн.травмат.', '40', 0, 0, '1', null, null, null, 12, 1, 'ЛікНеопл', '4', 0, null, null, '1', 0, null, null, null, null],
      ['41', 'Непідтверджений лікарняний', 'непідтверджений лікарняний', 'непідтвердженого лікарняного', 'непідтвердженим лікарняним', 'непідтверд.лікарн.', '41', 0, 0, '1', null, null, null, 12, 1, 'НеПідЛ', null, 0, null, null, '1', 0, null, null, null, null],

      ['45', 'Квартальна премія', 'квартальну премію', 'квартальної премії', 'квартальною премією', 'кварт. премія', '45', 0, 0, '1', null, 'PLAN', 'CALC', null, 0, null, null, 0, null, null, '1', 0, null, '1', 'DAY'],
      ['46', 'Річна премія', 'річну премію', 'річної премії', 'річною премією', 'річна премія', '46', 0, 0, '1', null, 'PLAN', 'CALC', null, 0, null, '3', 0, null, null, '1', 0, null, '1', 'DAY'],
      ['47', 'Разова премія', 'разову премію', 'разової премії', 'разовою премією', 'разова премія', '47', 0, 0, '1', null, 'PLAN', 'CALC', null, 0, null, null, 0, null, null, '1', 0, null, '1', 'DAY'],
      ['48', 'Тимчасова непрацездатність', 'тимчасову непрацездатність', 'тимчасової непрацездатності', 'тимчасовою непрацездатністю', 'тимч.непрацездат.', '48', 0, 0, '1', null, null, null, 12, 1, 'ЛікНеопл', '4', 0, null, null, '1', 0, null, null, null, null],
      ['49', 'Доплата до мінімальної суми', 'доплату до мінімальної суми', 'доплати до мінімальної суми', 'доплатою до мінімальної суми', 'допл.мін.сума', '49', 1, 1, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['50', 'Доплата до середнього заробітку', 'доплату до середнього заробітку', 'доплати до середнього заробітку', 'доплатою до середнього заробітку', 'допл.серед.зароб.', '50', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['51', 'Переведення на легшу роботу', 'переведення на легшу роботу', 'переведення на легшу роботу', 'переведенням на легшу роботу', 'легша робота', '51', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],

      ['53', 'Виплата за рахунок СС', 'виплату за рахунок СС', 'виплати за рахунок СС', 'виплатою за рахунок СС', 'випл.рахун.СС', '53', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['56', 'Доплата при скороченні робочого дня/тижня', 'доплату при скороченні робочого дня/тижня', 'доплати при скороченні робочого дня/тижня', 'доплатою при скороченні робочого дня/тижня', 'допл.скор.роб.д./т.', '56', 1, 1, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['57', 'Відпустка по догляду за дитиною до 6-х років', 'відпустку по догляду за дитиною до 6-х років', 'відпустки по догляду за дитиною до 6-х років', 'відпустки по догляду за дитиною до 6-х років', 'відп.дит. до 6-х р.', '57', 0, 0, '1', null, null, null, null, 1, 'Вдит', null, 0, null, null, '1', 0, null, null, null, null],
      ['58', 'Компенсація вимушеного прогулу', 'компенсацію вимушеного прогулу', 'компенсації вимушеного прогулу', 'компенсацією вимушеного прогулу', 'комп.вимуш.прогул', '58', 0, 1, '1', null, null, null, null, 1, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['61', 'Утримання за виконавчими листами', 'утримання за виконавчими листами', 'утримання за виконавчими листами', 'утриманням за виконавчими листами', 'утрим.викон.листи', '61', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['62', 'Перерахування за заявою працівника', 'перерахування за заявою працівника', 'перерахування за заявою працівника', 'перерахуванням за заявою працівника', 'перерах.заяв.прац.', '62', 0, 0, '1', null, 'FACT', 'CALC', null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['65', 'Премія за період', 'премію за період', 'премії за період', 'премією за період', 'премія.період', '65', 0, 0, '1', null, 'PLAN', 'CALC', null, 0, null, null, 0, null, null, '1', 0, null, '1', 'DAY'],
      ['66', 'Оплата за роботу в надурочний час', 'оплату за роботу в надурочний час', 'оплати за роботу в надурочний час', 'оплатою за роботу в надурочний час', 'опл.надурочн.час', '66', 1, 1, '1', null, 'PLAN', null, null, 0, 'РбДн', null, 0, null, null, '1', 0, null, null, null, null],

      ['42', 'Разове нарахування', 'разове нарахування', 'разового нарахування', 'разовим нарахуванням', 'разов.нарах.', '42', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['43', 'Разове утримання', 'разове утримання', 'разового утримання', 'разовим утриманням', 'разов.утрим.', '43', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['63', 'Відрядна оплата', 'відрядну оплату', 'відрядної оплати', 'відрядною оплатою', 'відрядна опл.', '63', 1, 1, '1', 'HOUR', null, null, null, 0, 'РбДн', null, 0, null, null, '1', 0, null, null, null, null],

      ['67', 'Навчальна відпустка', 'навчальну відпустку', 'навчальної відпустки', 'навчальною відпусткою', 'навч. відп.', '67', 0, 0, '1', null, null, null, 12, 1, 'Внавч', null, 0, null, null, '1', 0, null, null, null, null],
      ['68', 'Військові збори', 'військові збори', 'військових зборів', 'військовими зборами', 'військ.збори', '68', 0, 1, '1', 'DAY', null, null, 2, 1, 'ВЗб', null, 0, null, null, '1', 0, null, null, null, null],

      ['71', 'Залишок відпустки', 'залишок відпустки', 'залишку відпустки', 'залишком відпустки', 'залишок від.', '71', 0, 0, '1', null, null, null, 12, 1, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['72', 'Перерахування залишку відпустки', 'перерахування залишку відпустки', 'перерахування залишку відпустки', 'перерахування залишком відпустки', 'перерах.залиш.відп.', '72', 0, 0, '1', null, null, null, null, 1, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['73', 'Донорські дні', 'донорські дні', 'донорських днів', 'донорськими днями', 'донор. дні', '73', 0, 0, '1', null, null, null, 2, 1, 'НеявкаІн', null, 0, null, null, '1', 0, null, null, null, null],

      ['74', 'Оклад згідно з тарифним розрядом', 'оклад згідно з тарифним розрядом', 'окладу згідно з тарифним розрядом', 'окладом згідно з тарифним розрядом', 'оклад.тариф.розр.', '74', 1, 1, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 1, null, null, null, null],
      ['75', 'Виплата за джерелом фінансування', 'виплату за джерелом фінансування', 'виплати за джерелом фінансування', 'виплатою за джерелом фінансування', 'випл.джерел.фінанс.', '75', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],

      ['135', 'Відшкодування вартості поховання за рахунок СС', 'відшкодування вартості поховання за рахунок СС', 'відшкодування вартості поховання за рахунок СС', 'відшкодуванням вартості поховання за рахунок СС', 'відшкод.похов.СС', '135', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['137', 'Оплата простою', 'оплату простою', 'оплати простою', 'оплатою простою', 'опл.простою', '137', 1, 1, '1', 'HOUR', null, null, null, 0, 'Прст', null, 0, null, null, '1', 0, null, null, null, null],
      ['138', 'Переробіток', 'переробіток', 'переробітку', 'переробітком', 'переробіток', '138', 1, 1, '1', 'HOUR', null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['140', 'Відпустка по догляду за дитиною-інвалідом до 16/18 років', 'відпустку по догляду за дитиною-інвалідом до 16/18 років', 'відпустки по догляду за дитиною-інвалідом до 16/18 років', 'відпусткою по догляду за дитиною-інвалідом до 16/18 років', 'від.дит.інв.16-18р.', '140', 0, 0, '1', null, null, null, null, 1, 'Вваг', null, 0, null, null, '1', 0, null, null, null, null],
      ['141', 'Додаткове благо', 'додаткове благо', 'додаткового блага', 'додатковим благом', 'додатк.благо', '141', 0, 0, '1', null, null, null, null, 0, null, null, 0, null, null, '1', 0, null, null, null, null],
      ['142', 'Чорнобильська відпустка', 'чорнобильську відпустку', 'чорнобильської відпустки', 'чорнобильською відпусткою', 'чорноб.відп.', '142', 0, 0, '1', null, null, null, 12, 1, 'Вчорн', null, 0, null, null, '1', 0, null, null, null, null],
      ['149', 'Лікарняний самоізоляція COVID-19', 'лікарняний самоізоляція COVID-19', 'лікарняного самоізоляція COVID-19', 'лікарняним самоізоляція COVID-19', 'лікарн. COVID-19', '149', 0, 0, '1', null, null, null, 12, 1, 'ЛікХвор', '4', 0, null, null, '1', 0, null, null, null, null]
    ]
  }
]
