module.exports = [
  {
    entity: 'hr_dictMilitarySuitable',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name'],
    items: [
      ['0', 'Придатний'],
      ['1', 'Непридатний'],
      ['2', 'Непридатний у мирний час'],
      ['3', 'Обмежено придатний у воєнний час'],
      ['4', 'Стройовий'],
      ['5', 'Придатний до нестройової у воєнний час'],
      ['6', 'Обмежено придатний'],
      ['7', 'Тимчасово непридатний'],
      ['8', 'Непридатний у мирний час, обмежено придатний у воєнний час']
    ]
  }
]
