module.exports = [
  {
    entity: 'hr_dictMilitaryProfile',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    identifier: ['code'],
    attrs: ['code', 'name'],
    items: [
      ['1', 'командний'],
      ['2', 'інженерний'],
      ['3', 'технічний'],
      ['4', 'юридичний'],
      ['5', 'медичний'],
      ['6', 'ветеринарний'],
      ['7', 'науково-педагогічний'],
      ['8', 'політичний'],
      ['9', 'оперативний'],
      ['10', 'адміністративний'],
      ['11', 'оперативно-технічний']
    ]
  }
]
