module.exports = [
  {
    entity: 'hr_dictIllnessReason',
    localeAttr: ['name'],
    notDelete: true,
    notUpdate: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictIllnessReason').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    identifier: ['code', 'illnessKind'],
    attrsConfig: {
      payElUnpaidID: { associatedEntity: 'hr_payEl', codeAttr: 'code' },
      payElFOPID: { associatedEntity: 'hr_payEl', codeAttr: 'code' },
      payElFSSUID: { associatedEntity: 'hr_payEl', codeAttr: 'code' }
    },
    attrs: ['code', 'illnessKind', 'fullName', 'name', 'payElFOPID', 'maxDayFOP', 'payElFSSUID', 'payElUnpaidID', 'orderN', 'dateFromEmpty', 'dateToEmpty'],
    items: [
      ['1', '1', 'Загальне захворювання', 'Загальне захворювання', '17', 5, '18', '48', 1, null, null],
      ['2', '1', 'Професійне захворювання та його наслідки', 'Професійне захворювання та його наслідки', '17', 5, '18', '48', 6, null, null],
      ['3', '1', 'Захворювання внаслідок аварії на ЧАЕС', 'Захворювання внаслідок аварії на ЧАЕС', null, 0, '18', '48', 7, null, null],
      ['4', '1', 'Нещасний випадок на виробництві та його наслідки', 'Нещасний випадок на виробництві та його наслідки', null, 0, '40', '48', 5, null, null],
      ['5', '1', 'Невиробничі травми', 'Невиробничі травми', '17', 5, '18', '48', 2, null, null],
      ['6', '1', 'Контакт з хворими на інфекційні захворювання та бактеріоносійство', 'Контакт з хворими на інфекційні захворювання та бактеріоносійство', null, 0, '18', '48', 8, null, null],
      ['7', '1', 'Санаторно-курортне лікування', 'Санаторно-курортне лікування', null, 0, '18', '48', 9, null, null],
      ['8', '1', 'Вагітність та пологи', 'Вагітність та пологи', null, 0, '20', '48', 4, null, null],
      ['9', '1', 'Ортопедичне протезування', 'Ортопедичне протезування', '17', 5, '18', '48', 10, null, null],
      ['10', '1', 'Догляд', 'Догляд', null, 0, '19', '48', 2, null, null],
      ['11', '1', 'Самоізоляція (контакт з COVID) ', 'Самоізоляція (контакт з COVID) ', '17', 5, '18', '48', 1, null, null],
      ['1', '2', 'Загальне захворювання', 'Загальне захворювання', null, null, '48', '48', 1, null, null],
      ['10', '2', 'Догляд', 'Догляд', null, null, '48', '48', 2, null, null],
      ['1', '3', 'Тимчасова непрацездатність внаслідок захворювання або травми, що не пов’язані з нещасним випадком на виробництві', 'Загальне захворювання', '17', 5, '18', '48', 1, null, null],
      ['2', '3', 'Вагітність і пологи', 'Вагітність і пологи', null, null, '20', '48', 2, null, null],
      ['3', '3', 'Необхідність догляду за хворою дитиною', 'Догляд за дитиною', null, null, '19', '48', 3, null, null],
      ['4', '3', 'Необхідність догляду за хворим членом сім’ї', 'Догляд за хворим членом сім’ї', null, null, '19', '48', 5, null, null],
      ['5', '3', 'Необхідність догляду за дитиною віком до трьох років або дитиною з інвалідністю віком до 18 років у разі хвороби матері або іншої особи, яка доглядає за такою дитиною', 'Догляд за дитиною віком до трьох років', null, null, '19', '48', 6, null, null],
      ['6', '3', 'Карантин, встановлений відповідно до законодавства', 'Карантин', null, null, '18', '48', 12, null, null],
      ['7', '3', 'Протезування з поміщенням у стаціонар протезно-ортопедичного підприємства', 'Ортопедичне протезування', '17', 5, '18', '48', 11, null, null],
      ['8', '3', 'Перебування у відділенні санаторно-курортного закладу', 'Санаторно-курортне лікування', null, null, '18', '48', 9, null, null],
      ['9', '3', 'Тимчасове переведення застрахованої особи відповідно до медичного висновку на легшу, нижчеоплачувану роботу', 'Тимчасове переведення застрахованої особи відповідно до медичного висновку на легшу, нижчеоплачувану роботу', null, null, null, null, 10, null, null],
      ['10', '3', 'Перебування в самоізоляції, обсервації під час дії карантину, встановленого Кабінетом Міністрів України з метою запобігання поширенню гострої респіраторної хвороби COVID-19, спричиненої коронавірусом SARS-СoV-2', 'Самоізоляція (контакт з COVID-19) ', '17', 5, '18', '48', 4, null, null],
      ['11', '3', 'Тимчасова непрацездатність внаслідок професійного захворювання', 'Професійне захворювання', '17', 5, '18', '48', 7, null, null],
      ['12', '3', 'Тимчасова непрацездатність внаслідок нещасного випадку на виробництві', 'Нещасний випадок на виробництві', null, 0, '40', '48', 8, null, null]
    ]
  }
]
