module.exports = [
  {
    entity: 'hr_dictTimeForm',
    identifier: ['type'],
    notUpdate: true,
    notDelete: true,
    modifyWhere: (conn) => {
      return !conn.Repository('hr_dictTimeForm').attrs(['ID']).misc({ __allowSelectSafeDeleted: true }).limit(1).selectScalar()
    },
    attrs: ['code', 'name', 'type'],
    items: [
      ['1', 'Робочі години', '1'],
      ['2', 'Робочі дні', '2'],
      ['3', 'Графік роботи', '3'],
      ['4', 'Нічні години', '4'],
      // ['5', 'Вечірні години', '5'],
      // ['6', 'Шкідливі години', '6'],
      // ['7', 'Особливі години', '7'],
      // ['8', 'Додаткові години', '8'],
      // ['9', 'План (днів)', '9'],
      // ['10', 'План (годин)', '10'],
      ['11', 'Норма (днів)', '11'],
      ['12', 'Норма (годин)', '12'],
      // ['13', 'Факт (днів)', '13'],
      // ['14', 'Факт (годин)', '14'],
      // ['15', 'Факт (годин з додатковими)', '15'], //
      // ['16', 'Годин за ставкою (норма)', '16'],
      // ['17', 'Годин за ставкою (план)', '17'],
      ['18', 'Годин за нормою', '18'],
      // ['19', 'Годин за планом', '19'],
      ['20', 'Переробіток (норма)', '20'],
      // ['21', 'Переробіток (план)', '21'],
      ['22', 'Понаднормово (норма)', '22'],
      // ['23', 'Понаднормово (план)', '23'],
      ['24', 'Святкові', '24'],
      ['25', 'Вихідні', '25'],
      ['26', 'Лікарняні', '26'],
      ['27', 'Відпустки', '27'],
      ['28', 'Відрядження', '28'],
      ['29', 'Інше', '29']
    ]
  }
]
