module.exports = [
  {
    entity: 'hr_dictReport',
    identifier: ['code'],
    attrs: [ 'code', 'name', 'shortName', 'isExternal', 'showExtraParam' ],
    items: [
      [ 'hr_reportConsolAccDeduc', 'Консолідований звіт про нарахування та відрахування', 'Консолідований звіт про нарахування та відрахування', 1, 0 ],
      [ 'hr_accrual-timeCost', 'Список працівників з елементами обліку у табелі', 'Список працівників з елементами обліку у табелі', 0, 1 ],
      [ 'hr_accrual-minWage', 'Звіт про нарахування працівникові доплати до мінімальної заробітної плати', 'Звіт про нарахування працівникові доплати до мінімальної заробітної плати', 0, 0 ],
      [ 'hr_accrual-debtEmployees', 'Список працівників, які мають заборгованість на кінець місяця', 'Список працівників, які мають заборгованість на кінець місяця', 0, 1 ],
      [ 'hr_accrual-listAppointDismissEmp', 'Список працівників, що були прийняті або звільнені у періоді', 'Список працівників, що були прийняті або звільнені у періоді', 0, 1 ],
      [ 'hr_empListByLongVacation', 'Список працівників, що знаходяться у довготривалих відпустках', 'Список працівників, що знаходяться у довготривалих відпустках', 0, 1 ]
    ]
  }
]
