{
    "caption": "Перенос праздничных или рабочих дней – условия применения",
    "description": "Перенос праздничных или рабочих дней – условия применения",
    "attributes": [
        {
            "name": "calendarChangeID",
            "caption": "Перенос праздничных или рабочих дней",
            "description": "Перенос праздничных или рабочих дней"
        },
        {
            "name": "orgID",
            "caption": "Организация",
            "description": "Организация"
        }
    ]
}