{
    "caption": "Ограничение дней уплаты для больничных. режим",
    "description": "Ограничение дней уплаты для больничных. режим",
    "attributes": [
        {
            "name": "dictSicknessDayID",
            "caption": "Ограничение дней уплаты для больничных",
            "description": "Ограничение дней уплаты для больничных"
        },
        {
            "name": "illnessRegime",
            "caption": "Назначен режим",
            "description": "Назначен режим"
        },
        {
            "name": "isAge",
            "caption": "Признак использования ограничения на возраст",
            "description": "Признак использования ограничения на возраст"
        },
        {
            "name": "minAge",
            "caption": "Минимальный возраст",
            "description": "Минимальный возраст, для которого используется ограничение"
        },
        {
            "name": "maxAge",
            "caption": "Максимальный возраст",
            "description": "Максимальный возраст, для которого используется ограничение"
        },
        {
            "name": "dateFrom",
            "caption": "Действует с",
            "description": "Действует с"
        },
        {
            "name": "dateTo",
            "caption": "Действует по",
            "description": "Действует по"
        }
    ]
}