{
    "caption": "Льготы для расчета больничного",
    "description": "Льготы для расчета больничного",
    "attributes": [
        {
            "name": "dictIllnessReasonID",
            "caption": "Причина нетрудоспособности",
            "description": "Причина нетрудоспособности"
        },
        {
            "name": "typeBenefitsKind",
            "caption": "Принадлежность льготы",
            "description": "Принадлежность льготы"
        },
        {
            "name": "dictBenefitsKindID",
            "caption": "Вид льготы",
            "description": "Вид льготы"
        },
        {
            "name": "typeExperience",
            "caption": "Тип стажа",
            "description": "Тип стажа"
        },
        {
            "name": "priority",
            "caption": "Приоритет",
            "description": "Приоритет использования"
        },
        {
            "name": "isPercent",
            "caption": "Ограничения на процент",
            "description": "Признак использования ограничения на процент"
        },
        {
            "name": "minPercent",
            "caption": "Ограничения на процент (не менее)",
            "description": "Ограничения на процент (не менее)"
        },
        {
            "name": "isMinAvgSumPeriod",
            "caption": "Ограничения на среднедневный (не менее)",
            "description": "Признак использования ограничения на среднедневный за период (не менее)"
        },
        {
            "name": "typeMinAvgSumPeriod",
            "caption": "Тип ограничения на среднедневный (не менее)",
            "description": "Тип ограничения на среднедневный за период (не менее)"
        },
        {
            "name": "minAvgSumPeriod",
            "caption": "Коэф. ограничения на среднедневный (не менее)",
            "description": "Коэффициент ограничения на среднедневный за период (не менее)"
        },
        {
            "name": "isMaxAvgSumPeriod",
            "caption": "Ограничения на среднедневный (не более)",
            "description": "Признак использования ограничения на среднедневный за период (не более)"
        },
        {
            "name": "typeMaxAvgSumPeriod",
            "caption": "Тип ограничения на среднедневный (не более)",
            "description": "Тип ограничения на среднедневный за период (не более)"
        },
        {
            "name": "maxAvgSumPeriod",
            "caption": "Коэф. ограничения на среднедневный (не более)",
            "description": "Коэффициент ограничения на среднедневный за период (не более)"
        },
        {
            "name": "isMinAvgSumRst",
            "caption": "Ограничения на среднедневный для расчета (не менее)",
            "description": "Признак использования ограничения на среднедневный для расчета (не менее)"
        },
        {
            "name": "typeMinAvgSumRst",
            "caption": "Тип ограничения на среднедневный для расчета (не менее)",
            "description": "Тип ограничения на среднедневный для расчета (не менее)"
        },
        {
            "name": "minAvgSumRst",
            "caption": "Коэф. ограничения на среднедневный за период (не менее)",
            "description": "Коэффициент ограничения на среднедневный за период (не менее)"
        },
        {
            "name": "isMaxAvgSumRst",
            "caption": "Ограничения на среднедневный для расчета (не более)",
            "description": "Признак использования ограничения на среднедневный для расчета (не более)"
        },
        {
            "name": "typeMaxAvgSumRst",
            "caption": "Тип ограничения на среднедневный для расчета (не более)",
            "description": "Тип ограничения на среднедневный для расчета (не более)"
        },
        {
            "name": "maxAvgSumRst",
            "caption": "Коэф. ограничения на среднедневный за период (не более)",
            "description": "Коэффициент ограничения на среднедневный за период (не более)"
        },
        {
            "name": "dateFrom",
            "caption": "Период действия с",
            "description": "Период действия с"
        },
        {
            "name": "dateTo",
            "caption": "Период действия по",
            "description": "Период действия по"
        },
        {
            "name": "isAdd",
            "caption": "Дополнительное начисление",
            "description": "Дополнительное начисление"
        }
    ]
}