{
    "caption": "Плановые отпуска для приказа об утверждении графика отпусков",
    "description": "Плановые отпуска для приказа об утверждении графика отпусков",
    "attributes": [
        {
            "name": "orderDetID",
            "caption": "Пункт приказа об утверждении графика отпусков",
            "description": "Пункт приказа об утверждении графика отпусков"
        },
        {
            "name": "vacationScheduleID",
            "caption": "Плановый отпуск",
            "description": "Плановый отпуск"
        }
    ]
}