{
    "caption": "Приказ об отзыве из командировки, обучения, простоя. Периоды отзыва",
    "description": "Приказ об отзыве из командировки, обучения, простоя. Периоды отзыва",
    "attributes": [
        {
            "name": "orderID",
            "caption": "Приказ-основание",
            "description": "Приказ-основание"
        },
        {
            "name": "paraID",
            "caption": "Пункт приказа",
            "description": "Пункт приказа"
        },
        {
            "name": "entityParaID",
            "caption": "Пункт приказа об оплате дополнительной работы",
            "description": "Пункт приказа об оплате дополнительной работы"
        },
        {
            "name": "dayCount",
            "caption": "Количество дней неразрывной части",
            "description": "Количество дней неразрывной части"
        },
        {
            "name": "dateFrom",
            "caption": "Действует с",
            "description": "Действует с"
        },
        {
            "name": "dateTo",
            "caption": "Действует по",
            "description": "Действует по"
        }
    ]
}