{
    "caption": "Суммарные данные публичного портала",
    "description": "Суммарные данные публичного портала",
    "attributes": [
        {
            "name": "orgTotalAll",
            "caption": "Общее количество организаций в стране",
            "description": "Общее количество организаций в стране"
        },
        {
            "name": "orgTotal",
            "caption": "Количество организаций на данный момент времени",
            "description": "Количество организаций на данный момент времени"
        },
        {
            "name": "appointPercent",
            "caption": "Процент назначений (не менее)",
            "description": "Процент назначений (не менее)"
        },
        {
            "name": "refreshCurrentData",
            "caption": "Обновлять только текущие данные",
            "description": "Обновлять только текущие данные"
        },
        {
            "name": "orgTotal01",
            "caption": "Количество организаций на 01.01 текущего года",
            "description": "Количество организаций на 01.01 текущего года"
        },
        {
            "name": "empTotal",
            "caption": "Количество работников на данный момент времени",
            "description": "Количество работников на данный момент времени"
        },
        {
            "name": "empTotal01",
            "caption": "Количество работников на 01.01 текущего года",
            "description": "Количество работников на 01.01 текущего года"
        },
        {
            "name": "fillOrgPrc",
            "caption": "Процент выполнения по заведению в системе организаций на данный момент времени",
            "description": "Процент выполнения по заведению в системе организаций на данный момент времени"
        },
        {
            "name": "fillOrgPrc01",
            "caption": "Процент выполнения по заведению в системе организаций на 01.01 текущего года",
            "description": "Процент выполнения по заведению в системе организаций на 01.01 текущего года"
        },
        {
            "name": "sitePurpose",
            "caption": "Назначение окружения",
            "description": "Назначение окружения"
        },
        {
            "name": "calcDate",
            "caption": "Дата расчета",
            "description": "Дата расчета"
        }
    ]
}