{
    "caption": "Контрагент (импорт)",
    "description": "Контрагент (импорт)",
    "attributes": [
        {
            "name": "impID",
            "caption": "Внешний ID",
            "description": "Внешний ID"
        },
        {
            "name": "orgID",
            "caption": "Организационная единица",
            "description": "Организационная единица"
        },
        {
            "name": "code",
            "caption": "Внутренний код",
            "description": "Внутренний код организации"
        },
        {
            "name": "OKPOCode",
            "caption": "ЕГРПОУ/РНОКПП",
            "description": "ЕГРПОУ/РНОКПП"
        },
        {
            "name": "taxCode",
            "caption": "Налоговый №",
            "description": "Налоговый номер"
        },
        {
            "name": "orgBusinessTypeID",
            "caption": "Тип организации",
            "description": "Тип организации"
        },
        {
            "name": "vatCode",
            "caption": "№ св. НДС",
            "description": "№ свидетельства плательщика НДС"
        },
        {
            "name": "name",
            "caption": "Название организации",
            "description": "Название без кавычек и аббревиатур"
        },
        {
            "name": "fullName",
            "caption": "Полное название организации",
            "description": "Полное название организации, как это указано в свидетельстве о регистрации"
        },
        {
            "name": "nameGen",
            "caption": "Название организации в родительном падеже",
            "description": "Название без кавычек и аббревиатур в родительном падеже"
        },
        {
            "name": "nameDat",
            "caption": "Название организации в дательном падеже",
            "description": "Название без кавычек и аббревиатур в дательном падеже"
        },
        {
            "name": "fullNameGen",
            "caption": "Полное название организации в родительном падеже",
            "description": "Полное название организации, как это указано в свидетельстве о регистрации, в родительном падеже"
        },
        {
            "name": "fullNameDat",
            "caption": "Полное название организации в дательном падеже",
            "description": "Полное название организации, как это указано в свидетельстве о регистрации, в дательном падеже"
        },
        {
            "name": "description",
            "caption": "Описание",
            "description": "Описание организации"
        },
        {
            "name": "contrType",
            "caption": "Тип контрагента",
            "description": "Тип контрагента"
        },
        {
            "name": "addrText",
            "caption": "Формулировка адресата",
            "description": "Формулировка адресата, которое будет отображаться при генерации PDF образа исходного документа"
        },
        {
            "name": "caption",
            "caption": "Заголовок",
            "description": "Заголовок"
        },
        {
            "name": "nonResident",
            "caption": "Нерезидент",
            "description": "Нерезидент"
        },
        {
            "name": "impOrgID",
            "caption": "Внешняя организационная единица",
            "description": "Внешняя организационная единица"
        }
    ]
}