{
    "caption": "Метод расчета начислений на зарплату",
    "description": "Метод расчета начислений на зарплату",
    "attributes": [
        {
            "name": "code",
            "caption": "Код",
            "description": "Код"
        },
        {
            "name": "name",
            "caption": "Название",
            "description": "Название"
        },
        {
            "name": "correctByTime",
            "caption": "Корректировать максимальную базу начисления на время в трудовых отношениях",
            "description": "Корректировать максимальную базу начисления на время в трудовых отношениях"
        },
        {
            "name": "accrueUnSick",
            "caption": "Начислять при наличии неподтвержденного больничного",
            "description": "Начислять при наличии неподтвержденного больничного"
        },
        {
            "name": "description",
            "caption": "Описание",
            "description": "Описание"
        }
    ]
}