{
    "caption": "Блокировка расчета постоянных начислений и удержаний",
    "description": "Блокировка расчета постоянных начислений и удержаний",
    "attributes": [
        {
            "name": "payPermID",
            "caption": "Постоянные начисления/удержания организации",
            "description": "Постоянные начисления/удержания организации"
        },
        {
            "name": "employeeNumberID",
            "caption": "Табельный номер",
            "description": "Табельный номер"
        }
    ]
}