{
    "caption": "Перечень должностей работников, выполняющих функции обслуживания",
    "description": "Перечень должностей работников, выполняющих функции обслуживания",
    "attributes": [
        {
            "name": "structDepName",
            "caption": "Структурное подразделение",
            "description": "Структурное подразделение"
        },
        {
            "name": "posName",
            "caption": "Должность",
            "description": "Должность"
        },
        {
            "name": "quantity",
            "caption": "Количество штатных единиц",
            "description": "Количество штатных единиц"
        }
    ]
}