{
    "caption": "Расшифровка значений отчета \"Справка о количестве штатных единиц и фонда заработной платы по категориям персонала\"",
    "description": "Расшифровка значений отчета \"Справка о количестве штатных единиц и фонда заработной платы по категориям персонала\"",
    "attributes": [
        {
            "name": "ID",
            "caption": "Идентификатор",
            "description": "Идентификатор"
        },
        {
            "name": "idxNum",
            "caption": "Номер по порядку",
            "description": "Номер по порядку"
        },
        {
            "name": "name",
            "caption": "Название структурного подразделения или должности",
            "description": "Название структурного подразделения или должности"
        },
        {
            "name": "shortFIO",
            "caption": "ФИО",
            "description": "ФИО"
        },
        {
            "name": "quantity",
            "caption": "Количество должностей",
            "description": "Количество должностей"
        },
        {
            "name": "mtCount",
            "caption": "Занятых должностей",
            "description": "Занятых должностей"
        },
        {
            "name": "vacCount",
            "caption": "Свободных должностей",
            "description": "Свободных должностей"
        },
        {
            "name": "fundSum",
            "caption": "ФЛП",
            "description": "ФЛП"
        }
    ]
}