{
    "caption": "Отчет Информация к штатному расписанию (изменений в штатное расписание) органа исполнительной власти",
    "description": "Отчет Информация к штатному расписанию (изменений в штатное расписание) органа исполнительной власти",
    "attributes": [
        {
            "name": "fundSum1",
            "caption": "Фонд оплаты труда (без начислений) действующего ШР",
            "description": "Фонд оплаты труда (без начислений) действующего ШР"
        },
        {
            "name": "changesSum1",
            "caption": "Фонд оплаты труда (без начислений) изменений в ШР",
            "description": "Фонд оплаты труда (без начислений) изменений в ШР"
        },
        {
            "name": "resultSum1",
            "caption": "Фонд оплаты труда (без начислений) с учетом изменений",
            "description": "Фонд оплаты труда (без начислений) с учетом изменений"
        },
        {
            "name": "fundSum1_1",
            "caption": "Фонд по должностным окладам действующего ШР",
            "description": "Фонд по должностным окладам действующего ШР"
        },
        {
            "name": "changesSum1_1",
            "caption": "Фонд по должностным окладам изменений в ШР",
            "description": "Фонд по должностным окладам изменений в ШР"
        },
        {
            "name": "resultSum1_1",
            "caption": "Фонд по должностным окладам с учетом изменений",
            "description": "Фонд по должностным окладам с учетом изменений"
        },
        {
            "name": "fundSum1_2",
            "caption": "Фонд премирования действующего ШР",
            "description": "Фонд премирования действующего ШР"
        },
        {
            "name": "changesSum1_2",
            "caption": "Фонд премирования изменений в ШР",
            "description": "Фонд премирования изменений в ШР"
        },
        {
            "name": "resultSum1_2",
            "caption": "Фонд премирования с учетом изменений",
            "description": "Фонд премирования с учетом изменений"
        },
        {
            "name": "fundSum1_2_prc",
            "caption": "Процент в фонд премирования по должностным окладам действующего ШР",
            "description": "Процент в фонд премирования по должностным окладам действующего ШР"
        },
        {
            "name": "changesSum1_2_prc",
            "caption": "Процент в фонд премирования по должностным окладам изменений в ШР",
            "description": "Процент в фонд премирования по должностным окладам изменений в ШР"
        },
        {
            "name": "resultSum1_2_prc",
            "caption": "Процент в фонд премирования по должностным окладам с учетом изменений",
            "description": "Процент в фонд премирования по должностным окладам с учетом изменений"
        },
        {
            "name": "fundSum1_3",
            "caption": "Фонд для уплаты стимулирующих выплат действующего ШР",
            "description": "Фонд для уплаты стимулирующих выплат действующего ШР"
        },
        {
            "name": "changesSum1_3",
            "caption": "Фонд для уплаты стимулирующих выплат изменений в ШР",
            "description": "Фонд для уплаты стимулирующих выплат изменений в ШР"
        },
        {
            "name": "resultSum1_3",
            "caption": "Фонд для уплаты стимулирующих выплат с учетом изменений",
            "description": "Фонд для уплаты стимулирующих выплат с учетом изменений"
        },
        {
            "name": "fundSum1_3_prc",
            "caption": "Процент в фонд оплаты стимулирующих выплат по должностным окладам действующего ШР",
            "description": "Процент в фонд оплаты стимулирующих выплат по должностным окладам действующего ШР"
        },
        {
            "name": "changesSum1_3_prc",
            "caption": "Процент в фонд оплаты стимулирующих выплат по должностным окладам изменений в ШР",
            "description": "Процент в фонд оплаты стимулирующих выплат по должностным окладам изменений в ШР"
        },
        {
            "name": "resultSum1_3_prc",
            "caption": "Процент в фонд оплаты стимулирующих выплат по должностным окладам с учетом изменений",
            "description": "Процент в фонд оплаты стимулирующих выплат по должностным окладам с учетом изменений"
        },
        {
            "name": "fundSum2",
            "caption": "Штатная численность действующего ШР",
            "description": "Штатная численность действующего ШР"
        },
        {
            "name": "changesSum2",
            "caption": "Штатная численность изменений в ШР",
            "description": "Штатная численность изменений в ШР"
        },
        {
            "name": "resultSum2",
            "caption": "Штатная численность с учетом изменений",
            "description": "Штатная численность с учетом изменений"
        },
        {
            "name": "fundSum2_1",
            "caption": "Государственные служащие действующего ШР",
            "description": "Государственные служащие действующего ШР"
        },
        {
            "name": "changesSum2_1",
            "caption": "Государственные служащие изменений в ШР",
            "description": "Государственные служащие изменений в ШР"
        },
        {
            "name": "resultSum2_1",
            "caption": "Государственные служащие с учетом изменений",
            "description": "Государственные служащие с учетом изменений"
        },
        {
            "name": "fundSum2_1_1",
            "caption": "Категории А и Б единиц действующего ШР",
            "description": "Категории А и Б единиц действующего ШР"
        },
        {
            "name": "changesSum2_1_1",
            "caption": "Категории А и Б единиц изменений в ШР",
            "description": "Категории А и Б единиц изменений в ШР"
        },
        {
            "name": "resultSum2_1_1",
            "caption": "Категории А и Б единиц с учетом изменений",
            "description": "Категории А и Б единиц с учетом изменений"
        },
        {
            "name": "fundSum2_1_1_prc",
            "caption": "Категории А и Б процент действующего ШР",
            "description": "Категории А и Б процент действующего ШР"
        },
        {
            "name": "changesSum2_1_1_prc",
            "caption": "Категории А и Б процент изменений в ШР",
            "description": "Категории А и Б процент изменений в ШР"
        },
        {
            "name": "resultSum2_1_1_prc",
            "caption": "Категории А и Б процент с учетом изменений",
            "description": "Категории А и Б процент с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_1",
            "caption": "Группа 1 действующего ШР",
            "description": "Группа 1 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_1",
            "caption": "Группа 1 изменений в ШР",
            "description": "Группа 1 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_1",
            "caption": "Группа 1 с учетом изменений",
            "description": "Группа 1 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_2",
            "caption": "Группа 2 действующего ШР",
            "description": "Группа 2 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_2",
            "caption": "Группа 2 изменений в ШР",
            "description": "Группа 2 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_2",
            "caption": "Группа 2 с учетом изменений",
            "description": "Группа 2 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_3",
            "caption": "Группа 3 действующего ШР",
            "description": "Группа 3 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_3",
            "caption": "Группа 3 изменений в ШР",
            "description": "Группа 3 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_3",
            "caption": "Группа 3 с учетом изменений",
            "description": "Группа 3 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_4",
            "caption": "Группа 4 действующего ШР",
            "description": "Группа 4 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_4",
            "caption": "Группа 4 изменений в ШР",
            "description": "Группа 4 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_4",
            "caption": "Группа 4 с учетом изменений",
            "description": "Группа 4 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_5",
            "caption": "Группа 5 действующего ШР",
            "description": "Группа 5 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_5",
            "caption": "Группа 5 изменений в ШР",
            "description": "Группа 5 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_5",
            "caption": "Группа 5 с учетом изменений",
            "description": "Группа 5 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_6",
            "caption": "Группа 6 действующего ШР",
            "description": "Группа 6 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_6",
            "caption": "Группа 6 изменений в ШР",
            "description": "Группа 6 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_6",
            "caption": "Группа 6 с учетом изменений",
            "description": "Группа 6 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_7",
            "caption": "Группа 7 действующего ШР",
            "description": "Группа 7 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_7",
            "caption": "Группа 7 изменений в ШР",
            "description": "Группа 7 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_7",
            "caption": "Группа 7 с учетом изменений",
            "description": "Группа 7 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_8",
            "caption": "Группа 8 действующего ШР",
            "description": "Группа 8 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_8",
            "caption": "Группа 8 изменений в ШР",
            "description": "Группа 8 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_8",
            "caption": "Группа 8 с учетом изменений",
            "description": "Группа 8 с учетом изменений"
        },
        {
            "name": "fundSum2_1_2_9",
            "caption": "Группа 9 действующего ШР",
            "description": "Группа 9 действующего ШР"
        },
        {
            "name": "changesSum2_1_2_9",
            "caption": "Группа 9 изменений в ШР",
            "description": "Группа 9 изменений в ШР"
        },
        {
            "name": "resultSum2_1_2_9",
            "caption": "Группа 9 с учетом изменений",
            "description": "Группа 9 с учетом изменений"
        },
        {
            "name": "fundSum2_2",
            "caption": "Работники патронатных служб действующего ШР",
            "description": "Работники патронатных служб действующего ШР"
        },
        {
            "name": "changesSum2_2",
            "caption": "Работники патронатных служб изменений в ШР",
            "description": "Работники патронатных служб изменений в ШР"
        },
        {
            "name": "resultSum2_2",
            "caption": "Работники патронатных служб с учетом изменений",
            "description": "Работники патронатных служб с учетом изменений"
        },
        {
            "name": "fundSum2_3",
            "caption": "Работники, выполняющие функции по обслуживанию действующего ШР",
            "description": "Работники, выполняющие функции по обслуживанию действующего ШР"
        },
        {
            "name": "changesSum2_3",
            "caption": "Работники, выполняющие функции по обслуживанию изменений в ШР",
            "description": "Работники, выполняющие функции по обслуживанию изменений в ШР"
        },
        {
            "name": "resultSum2_3",
            "caption": "Работники, выполняющие функции по обслуживанию с учетом изменений",
            "description": "Работники, выполняющие функции по обслуживанию с учетом изменений"
        },
        {
            "name": "fundSum2_4",
            "caption": "Рабочие, занятые обслуговуваннням действующего ШР",
            "description": "Рабочие, занятые обслуговуваннням действующего ШР"
        },
        {
            "name": "changesSum2_4",
            "caption": "Рабочие, занятые обслуговуваннням изменений в ШР",
            "description": "Рабочие, занятые обслуговуваннням изменений в ШР"
        },
        {
            "name": "resultSum2_4",
            "caption": "Рабочие, занятые обслуговуваннням с учетом изменений",
            "description": "Рабочие, занятые обслуговуваннням с учетом изменений"
        }
    ]
}