{
    "caption": "Організации для включения начислений в заявку СС",
    "description": "Организации для включения начислений в заявку СС",
    "attributes": [
        {
            "name": "orgID",
            "caption": "Организация",
            "description": "Организация"
        },
        {
            "name": "subOrgID",
            "caption": "Організация для включения начислений в заявку СС",
            "description": "Організация для включения начислений в заявку СС"
        }
    ]
}