{
    "caption": "Подразделение",
    "description": "Подразделение",
    "attributes": [
        {
            "name": "ORGAN_ID",
            "caption": "Организация",
            "description": "Код организации, в которой находится подразделение (уникальный для организации)"
        },
        {
            "name": "NAME",
            "caption": "Имя подразделения",
            "description": "Имя подразделения"
        },
        {
            "name": "NAME_GENITIVE",
            "caption": "Имя подразделения в приказе о зачислении",
            "description": "Имя подразделения в приказе о зачислении"
        },
        {
            "name": "NAME_DATIVE",
            "caption": "Имя подразделения в приказе о",
            "description": "Имя подразделения в приказе о"
        },
        {
            "name": "SORT_ORDER",
            "caption": "Порядок сортировки",
            "description": "Порядок сортировки"
        },
        {
            "name": "STAFF_ID",
            "caption": "Ид-тор подразделения",
            "description": "Ид-тор подразделения"
        },
        {
            "name": "CODE",
            "caption": "Код подразделения",
            "description": "Код подразделения"
        },
        {
            "name": "STAFF",
            "caption": "Корневое подразделение штатного росписания, которому принадлежит текущая запись",
            "description": "Корневое подразделение штатного росписания, которому принадлежит текущая запись"
        },
        {
            "name": "PARENT_ID",
            "caption": "Код управляющего подразделения",
            "description": "Код управляющего подразделения"
        },
        {
            "name": "IS_ORGAN",
            "caption": "Есть органом",
            "description": "Y, если текущая запись представляет орган"
        },
        {
            "name": "CREATE_DATE",
            "caption": "Дата создания",
            "description": "Дата создания подразделения"
        },
        {
            "name": "CREATE_DOC_NUMBER",
            "caption": "Номер документа о создании",
            "description": "Номер документа о создании подразделения"
        },
        {
            "name": "CREATE_DOC_DATE",
            "caption": "Дата документа о создании",
            "description": "Дата документа о создании подразделения"
        },
        {
            "name": "FINISH_DATE",
            "caption": "Дата ликвидации",
            "description": "Дата, с которой подразделение является ликвидированным"
        },
        {
            "name": "FINISH_DOC_NUMBER",
            "caption": "Номер документа о ликвидации",
            "description": "Номер документа о ликвидации подразделения"
        },
        {
            "name": "FINISH_DOC_DATE",
            "caption": "Дата документа о ликвидации",
            "description": "Дата документа о ликвидации подразделения"
        },
        {
            "name": "NAME_PREPOSITIONAL",
            "caption": "Название подразделения в падеже",
            "description": "Название подразделения в падеже"
        },
        {
            "name": "impSourceID",
            "caption": "Код источника",
            "description": "Код источника данных импорта"
        }
    ]
}